{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Obsidian Blog",
	"language": "en",
	"home_page_url": "https://obsidian.md/",
	"feed_url": "https://obsidian.md/feed.json",
	"description": "New blog posts from the Obsidian team.",
	"author": {
		"name": "Obsidian",
		"url": "https://obsidian.md/"
	},
	"items": [
		{
			"id": "https://obsidian.md/blog/2024-obsidian-october/",
			"url": "https://obsidian.md/blog/2024-obsidian-october/",
			"title": "Obsidian October 2024",
			"content_html": "<p>October is here, which means only one thing: Obsidian October aka O_O is here! And this year we're making O_O all about <em>speed</em>.</p>\n<p>Every year O_O has introduced developers to the world of making Obsidian plugins. Today, there are nearly 2,000 community-built plugins. We never imagined that the ecosystem would be so rich and expansive.</p>\n<p>So this year, we're switching things up. We want to encourage the developer community to revisit existing plugins to make them even better.</p>\n<p>In the last few months, we have put a major emphasis on app performance while continuing to expand the <a href=\"https://docs.obsidian.md/\">plugin API</a>. We want to see more plugins adopt these new APIs, and focus on creating a snappy experience.</p>\n<p>This month you can join Obsidian October in the following ways.</p>\n<p><strong>Sign up for a plugin critique.</strong> If you want to have your plugin critiqued by the Obsidian team, <a href=\"https://discord.com/channels/686053708261228577/840286264964022302/1290743805708079198\">sign up on Discord</a>.</p>\n<p><strong>Self-assessment.</strong> Follow our checklists to improve your plugin, theme, or vault:</p>\n<ul>\n<li><a href=\"https://docs.obsidian.md/oo24/plugin\">Plugin checklist</a></li>\n<li><a href=\"https://docs.obsidian.md/oo24/theme\">Theme checklist</a></li>\n<li><a href=\"https://docs.obsidian.md/oo24/vault\">Vault checklist</a></li>\n</ul>\n<p><strong>Join new Discord channels</strong> to <a href=\"https://discord.com/channels/686053708261228577/1290740823893344378\">showcase your project</a> and <a href=\"https://discord.com/channels/686053708261228577/1290741034720039022\">chat with other participants</a>.</p>\n<hr />\n<p>We hope everyone has a great time! 🍻</p>\n",
			"date_published": "2024-10-01T00:00:00Z", 
			"author": {
				"name": "silver"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/standard-plan/",
			"url": "https://obsidian.md/blog/standard-plan/",
			"title": "Obsidian Sync now starts at $4 per month with the new Standard plan",
			"content_html": "<p>Today we are making <a href=\"https://obsidian.md/sync\">Obsidian Sync</a> more accessible with the new <em>Standard</em> plan which starts at $4 per month billed annually, or $5 per month billed monthly.</p>\n<p>Obsidian Sync is the easiest way to securely sync your notes across devices, with end-to-end encryption, version history, and collaborative <a href=\"https://help.obsidian.md/Obsidian+Sync/Collaborate+on+a+shared+vault\">shared vaults</a>.</p>\n<p>Below is a comparison between the new Standard plan and the existing Plus plan, billed annually:</p>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Standard</th>\n<th>Plus</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Price</td>\n<td>$4 per month</td>\n<td>$8 per month</td>\n</tr>\n<tr>\n<td>Synced vaults</td>\n<td>1</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Maximum file size</td>\n<td>5 MB</td>\n<td>200 MB</td>\n</tr>\n<tr>\n<td>Total storage</td>\n<td>1 GB</td>\n<td>10 GB*</td>\n</tr>\n<tr>\n<td>Revision history</td>\n<td>1 month</td>\n<td>12 months</td>\n</tr>\n<tr>\n<td>Devices</td>\n<td>Unlimited</td>\n<td>Unlimited</td>\n</tr>\n<tr>\n<td>Shared vaults</td>\n<td>Yes</td>\n<td>Yes</td>\n</tr>\n</tbody>\n</table>\n<div class=\"text-sm text-muted pb-6\">*Storage on the Sync Plus plan can be increased to 100&nbsp;GB for $16 per month, billed annually. If you are an early supporter, the storage on your Sync Plus plan remains unchanged at 50&nbsp;GB.</div>\n<p>As we state in our <a href=\"https://obsidian.md/about\">Manifesto</a>, we believe that everyone should have the tools to think clearly and organize ideas effectively. We are committed to keeping Obsidian apps free for personal use without any requirement to sign up for an account. Our add-on services <a href=\"https://obsidian.md/sync\">Obsidian Sync</a> and <a href=\"https://obsidian.md/publish\">Publish</a> allow us to remain <a href=\"https://stephango.com/vcware\">100% user-supported</a>, and help us fund continued development.</p>\n<p>Because Obsidian is built on local files that you control, our add-on services have many free alternatives and self-hostable options. Obsidian Sync is our approach to making the most intuitive and secure sync option. With this new plan, we're excited to make Sync accessible to even more people!</p>\n<p><a href=\"https://obsidian.md/account\">Start using Sync →</a></p>\n<h3>FAQ</h3>\n<p><strong>As a current Sync subscriber what happens to my plan?</strong><br />\nNothing changes. Your Sync plan is now called <em>Sync Plus</em> and has all the same features and pricing as before, including any discounts you may have.</p>\n<p><strong>How do these new plans affect early bird pricing, non-profit, or educational discounts?</strong><br />\nAny discounts on your account can be applied to the new Standard plan.</p>\n<p><strong>Do shared vaults count towards the number of vaults?</strong><br />\nOnly <a href=\"https://help.obsidian.md/Obsidian+Sync/Local+and+remote+vaults\">remote vaults</a> that you create count towards your vault limit. Remote vaults that are shared with you by another user do not count towards your vault limit.</p>\n<p><strong>Can I upgrade from Standard to Plus?</strong><br />\nYes. You can upgrade at any time and pricing is prorated.</p>\n<p><strong>Can I downgrade from Plus to Standard?</strong><br />\nYes. To downgrade you must first make sure that your account meets the constraints of the Standard plan — meaning that you have only 1 remote vault with less than 1 GB used.</p>\n<p><strong>Can I retain 50GB of storage if I downgrade to Standard?</strong><br />\nNo. If you are an early supporter and purchased the Plus plan with 50 GB before January 1st 2024, you must remain on the Plus plan to continue receiving 50 GB of storage.</p>\n<hr />\n<p>More questions? Visit our <a href=\"https://help.obsidian.md/Obsidian+Sync\">Help site →</a></p>\n",
			"date_published": "2024-03-20T00:00:00Z", 
			"author": {
				"name": "kepano"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/json-canvas/",
			"url": "https://obsidian.md/blog/json-canvas/",
			"title": "Announcing JSON Canvas: an open file format for infinite canvas data",
			"content_html": "<p>Today we're excited to announce that the <a href=\"https://obsidian.md/canvas\">Obsidian Canvas</a> file format is now called <a href=\"https://jsoncanvas.org/\">JSON Canvas</a> and has its own site, specification, and open source resources at <a href=\"https://jsoncanvas.org/\">jsoncanvas.org</a>.</p>\n<p>JSON Canvas can be implemented freely as an import, export, and storage format for <a href=\"https://jsoncanvas.org/docs/apps/\">any app or tool</a>. All the resources associated with JSON Canvas are open source under the MIT license, and can be found <a href=\"https://github.com/obsidianmd/jsoncanvas\">on GitHub</a>.</p>\n<p>For the <a href=\"https://obsidian.md/changelog/2022-12-05-desktop-v1.1.0/\">release</a> of Obsidian Canvas we created the <code>.canvas</code> format with an open spec. We created this format because we felt it was essential to follow the <a href=\"https://obsidian.md/about\">principles</a> that have guided us since the start. Your Obsidian data should always be stored locally, accessible offline, completely in your control, in open file formats that are <a href=\"https://stephango.com/file-over-app\">easy to retrieve and read</a>. For notes we achieve this by using plain text <code>.md</code> files with Markdown syntax, a widely supported format. However, infinite canvas data does not yet have a similarly established format.</p>\n<p>While infinite canvas tools are not new, they have been quickly <a href=\"https://infinitecanvas.tools/\">growing in popularity</a>. The JSON Canvas format was created in hopes of providing longevity, readability, interoperability, and extensibility to data created with infinite canvas apps. The format is designed to be easy to parse and give users ownership over their data.</p>\n<p>The JSON Canvas spec is currently at <a href=\"https://jsoncanvas.org/spec/1.0\">version 1.0</a>. The spec is relatively conservative, it does not support every feature that canvas apps may want to implement. However we think it is a useful starting point to build upon, and we plan to continue improving on it over time.</p>\n",
			"date_published": "2024-03-11T00:00:00Z", 
			"author": {
				"name": "kepano"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/2023-goty-winners/",
			"url": "https://obsidian.md/blog/2023-goty-winners/",
			"title": "2023 Gems of the year winners",
			"content_html": "<p>It has been nearly four years since the first line of code of Obsidian was written on January 31st, 2020. Today we're thrilled to announce the winners of our fourth annual Gems of the Year awards!</p>\n<p>This year the Obsidian community nominated 287 projects, including plugins, themes, tools, content, and templates. After our panel narrowed down the selection and the community voted on the entries, we're now excited to announce the winners.</p>\n<p>🎉 Thank you to everyone who participated, and congratulations to the winners! <em>We will be in touch with winners soon so you can receive your prizes.</em></p>\n<h2>New plugin</h2>\n<h3>Winner</h3>\n<p>🏆 <a href=\"https://github.com/omnivore-app/obsidian-omnivore\">Omnivore</a> by Omnivore</p>\n<blockquote>\n<p>Obsidian plugin to fetch articles and highlights from Omnivore.</p>\n</blockquote>\n<h3>Runners up</h3>\n<p><a href=\"https://github.com/LostPaul/obsidian-folder-notes\">Folder Notes</a> by @LostPaul</p>\n<blockquote>\n<p>Create notes within folders that can be accessed without collapsing the folder, similar to the functionality offered in Notion.</p>\n</blockquote>\n<p><a href=\"https://github.com/olrenso/obsidian-home-tab\">Home Tab</a> by @olrenso</p>\n<blockquote>\n<p>A browser-like search tab for your local files in Obsidian.</p>\n</blockquote>\n<p><a href=\"https://github.com/ivan-lednev/better-search-views\">Better Search Views</a> by Ivan Lednev</p>\n<blockquote>\n<p>Outliner-like breadcrumb trees for search, backlinks and embedded queries.</p>\n</blockquote>\n<p><a href=\"https://github.com/brianpetro/obsidian-smart-connections\">Smart Connections</a> by Brian Petro (@WFHBrian)</p>\n<blockquote>\n<p>Chat with your notes in Obsidian! Plus, see what's most relevant in real-time! Interact and stay organized. Powered by OpenAI ChatGPT, GPT-4 &amp; Embeddings.</p>\n</blockquote>\n<h2>New theme</h2>\n<h3>Winner</h3>\n<p>🏆 <a href=\"https://github.com/Akifyss/obsidian-border\">Border</a> by Akifyss</p>\n<blockquote>\n<p>A clean and highly customisable theme for Obsidian.</p>\n</blockquote>\n<h3>Runners up</h3>\n<p><a href=\"https://github.com/kepano/flexoki-obsidian\">Flexoki</a> by Steph Ango (@kepano)</p>\n<blockquote>\n<p>Flexoki, an inky color scheme for Obsidian.</p>\n</blockquote>\n<p><a href=\"https://github.com/tcmmichaelb139/obsidian-tokyonight\">Tokyo Night</a> by Michael Bao</p>\n<blockquote>\n<p>A Tokyo Night theme for Obsidian. Colors from tokyonight.nvim and VSCode Tokyonight.</p>\n</blockquote>\n<h2>Existing plugin</h2>\n<h3>Winner</h3>\n<p>🏆 <a href=\"https://github.com/scambier/obsidian-omnisearch\">Omnisearch</a> by Simon Cambier</p>\n<blockquote>\n<p>Omnisearch is a search engine that &quot;just works&quot;. It always instantly shows you the most relevant results, thanks to its smart weighting algorithm.</p>\n</blockquote>\n<h3>Runners up</h3>\n<p><a href=\"https://github.com/chhoumann/quickadd\">QuickAdd</a> by Christian Bager Bach Houmann (@chhoumann)</p>\n<blockquote>\n<p>QuickAdd is a powerful combination of four tools: templates, captures, macros, and multis.</p>\n</blockquote>\n<p><a href=\"https://github.com/platers/obsidian-linter\">Linter</a> by Victor Tao (@platers)</p>\n<blockquote>\n<p>Formats and styles your notes with a focus on configurability and extensibility.</p>\n</blockquote>\n<p><a href=\"https://github.com/mdelobelle/metadatamenu\">Metadata Menu</a> by Mathieu Delobelle (@mdelobelle)</p>\n<blockquote>\n<p>For data management enthusiasts: type and manage the metadata of your notes.</p>\n</blockquote>\n<p><a href=\"https://github.com/liamcain/obsidian-periodic-notes\">Periodic Notes</a> by Liam Cain</p>\n<blockquote>\n<p>The Periodic Notes plugin expands on the idea of daily notes and introduces weekly and monthly notes.</p>\n</blockquote>\n<h2>Tools</h2>\n<p>This new category highlights bookmarklets, browser extensions, publishing tools, scripts, and any other non-plugin tools that work with with Obsidian.</p>\n<h3>Winner</h3>\n<p>🏆 <a href=\"https://quartz.jzhao.xyz/\">Quartz</a> by Jacky Zhao</p>\n<blockquote>\n<p>A fast, batteries-included static-site generator that transforms Markdown content into fully functional websites.</p>\n</blockquote>\n<h3>Runners up</h3>\n<p><a href=\"https://tfthacker.com/canvas-candy\">Canvas Candy</a> by @TfTHacker</p>\n<blockquote>\n<p>The Canvas Candy Vault is a set of tools specially designed for use with the canvas feature of Obsidian.</p>\n</blockquote>\n<p><a href=\"https://github.com/ebullient/ttrpg-convert-cli\">TTRPG-Convert-CLI</a> by Erin Schnabel (@ebullient)</p>\n<blockquote>\n<p>Utility to convert JSON data (for content you own) from 5etools or pf2etools into Obsidian-friendly Markdown.</p>\n</blockquote>\n<h2>Content</h2>\n<h3>Winner</h3>\n<p>🏆 <a href=\"https://www.youtube.com/@nicolevdh\">Nicole van der Hoeven</a> by Nicole van der Hoeven</p>\n<blockquote>\n<p>Nicole is a developer advocate at k6.io (Grafana Labs), and she talks about testing for application performance, travelling the world while working, and the work-changing magic of taking notes.</p>\n</blockquote>\n<h3>Runners up</h3>\n<p><a href=\"https://www.youtube.com/watch?v=DbsAQSIKQXk\">Hack your brain with Obsidian</a> by No Boilerplate</p>\n<blockquote>\n<p>Tris has used many note-taking tools over the years, simple-note, notion, and extensively emacs org-mode, none have improved his thinking in the way that Obsidian has. Today is a deep-dive into my second brain, and if you take my advice, YOUR second brain.</p>\n</blockquote>\n<p><a href=\"https://www.youtube.com/@DannyHatcher\">Danny Hatcher's YouTube channel</a> by Danny Hatcher</p>\n<blockquote>\n<p>Danny makes videos about research, tech, and other related topics.</p>\n</blockquote>\n<h2>Template</h2>\n<h3>Winner</h3>\n<p>🏆 <a href=\"https://github.com/TfTHacker/DashboardPlusPlus\">Dashboard++</a> by @TfTHacker</p>\n<blockquote>\n<p>Demonstrating the Dashboard++ method of organizing a vault in Obsidian.</p>\n</blockquote>\n<h3>Runners up</h3>\n<p><a href=\"https://start.linkingyourthinking.com/ideaverse-for-obsidian\">Ideaverse</a> by Nick Milo</p>\n<blockquote>\n<p>Ideaverse is a starter kit to manage your whole life created by Nick Milo, founder of Linking Your Thinking.</p>\n</blockquote>\n<p><a href=\"https://stephango.com/vault\">Kepano Vault Template</a> by Steph Ango (@kepano)</p>\n<blockquote>\n<p>Steph's personal Obsidian vault template. A bottom-up approach to note-taking and organizing things he is interested in.</p>\n</blockquote>\n<hr />\n<p>Congratulations again to all who won and participated!</p>\n<p>Previous Gems of the Year:</p>\n<p><a href=\"https://obsidian.md/blog/2020-goty-winners/\">2020</a> | <a href=\"https://obsidian.md/blog/2021-goty-winners/\">2021</a> | <a href=\"https://obsidian.md/blog/2022-goty-winners/\">2022</a></p>\n",
			"date_published": "2024-01-24T00:00:00Z", 
			"author": {
				"name": "silver"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/cure53-security-audit/",
			"url": "https://obsidian.md/blog/cure53-security-audit/",
			"title": "New security page and independent audit completed by Cure53",
			"content_html": "<p>Obsidian is designed to be a private and secure space for your thoughts. Since the start, Obsidian has been built to give you full control over your data, without the requirement to sign up for an account or share any private information.</p>\n<p>Our new <a href=\"https://obsidian.md/security\">Security page</a> compiles information about how Obsidian approaches protecting your data. It is also the home for security audits completed by third parties. Our first audit by Cure53 is now available, and detailed below.</p>\n<p>We make Obsidian so that we can capture our own private thoughts and ideas. Independent audits help us ensure that our code and procedures meet the highest security standards. We will continue working with industry-leading security firms on more audits that provide comprehensive coverage and transparency towards this commitment.</p>\n<h3>Independent audit of Obsidian apps by Cure53</h3>\n<p>We asked the Berlin-based security firm <a href=\"https://cure53.de/\">Cure53</a> to perform a penetration test and source code audit of the Obsidian apps. A future report will provide an audit of the Obsidian Sync server.</p>\n<p>We invite you to read <a href=\"https://obsidian.md/files/security/2023-11-Obsidian-Cure53-Audit-Summary.pdf\">a summary of the findings</a> and the <a href=\"https://obsidian.md/files/security/2023-11-Obsidian-Cure53-Audit-Full.pdf\">full report</a>. The project concluded in late December 2023, with fixes incorporated into <a href=\"https://obsidian.md/changelog/2023-12-26-desktop-v1.5.3/\">Obsidian 1.5.3</a> released publicly on December 26th, 2023.</p>\n<p>During the audit, the Cure53 team discovered four vulnerabilities that were promptly resolved:</p>\n<ul>\n<li>CORS bypass via flawed URL validation</li>\n<li>Arbitrary file read via local file embedding</li>\n<li>Arbitrary file write via path traversal in Sync plugin</li>\n<li>App protocol origin leak via CSS snippets</li>\n</ul>\n<p>We're proud to report that the Cure53 team reviewed the resolutions and concluded that their recommendations have been properly followed. From the report summary:</p>\n<blockquote>\n<p>As the final phase of this project, in late December 2023, Cure53 conducted a remediation verification phase to examine how the Obsidian scope has improved over time and in relation to the findings communicated. In this area, the audit team is pleased to report that all vulnerabilities have been properly addressed and the recommendations from the assessment have been properly followed. Cure53 was able to review the diffs created by the Obsidian team to fix the reported issues and was therefore able to make reliable judgments about the quality of the fixes.</p>\n<p>From the perspective of the Cure53 team, appropriate steps have been taken to ensure that good fixes have been created and are now in effect for the Obsidian clients, UI and features.</p>\n</blockquote>\n<p>We look forward to publishing more security audits and updates, so you can continue to feel confident trusting Obsidian apps and services.</p>\n",
			"date_published": "2024-01-10T00:00:00Z", 
			"author": {
				"name": "kepano"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/2023-goty-nominations/",
			"url": "https://obsidian.md/blog/2023-goty-nominations/",
			"title": "2023 Gems of the year nominations",
			"content_html": "<p>The year is almost over and that means it's time to nominate your favorite projects from the Obsidian community for our Gems of the Year awards!</p>\n<p>To nominate projects go here: <a href=\"https://airtable.com/appGYQmbdmPaXnxhD/pagjmQhiNSdRnmBm5/form\">Gems of the Year 2023 Nomination</a></p>\n<p>Nominations are due by January 3rd, 2024. We look forward to your nominations! Voting will begin soon after.</p>\n<p>Project can be nominated in any of the following categories:</p>\n<ul>\n<li>Plugins</li>\n<li>Themes</li>\n<li>Tools — e.g. bookmarklets, browser extensions, publishing tools, scripts, etc</li>\n<li>Content — e.g. videos, blog posts, etc</li>\n<li>Vault templates</li>\n</ul>\n<p>A few words on nominations:</p>\n<ul>\n<li>Anyone can nominate, no login or account is required.</li>\n<li>You can nominate new projects created in 2023, or existing projects that were updated in 2023.</li>\n<li>You can nominate your own project.</li>\n<li>You can submit multiple nominations.</li>\n</ul>\n<p>Once nominations are in, the Obsidian team will select projects for the voting phase. Nominations help us gather a list of projects, so the number of nominations per project doesn't affect the outcome. Once nominations end, you'll have the opportunity to vote on your favorite projects for the final awards and prizes!</p>\n",
			"date_published": "2023-12-22T00:00:00Z", 
			"author": {
				"name": "silver"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/new-sync-plans/",
			"url": "https://obsidian.md/blog/new-sync-plans/",
			"title": "New Obsidian Sync plans: bigger, better, faster, smoother",
			"content_html": "<p><a href=\"https://obsidian.md/sync\">Obsidian Sync</a> makes it easy to securely sync your Obsidian data across all major mobile and desktop platforms with end-to-end encryption, version history, and granular settings per device. Today we're excited to share a host of improvements to Obsidian Sync.</p>\n<h3>What's new?</h3>\n<p>Over the next few weeks, we will be updating Obsidian Sync to support the following improvements:</p>\n<ul>\n<li><strong>More vaults.</strong> Vault limit has increased from 5 to 10 vaults.</li>\n<li><strong>Flexible storage.</strong> Per-vault storage limits have changed to a single account-wide storage limit. This means you can allocate your storage any way you want across all your vaults.</li>\n<li><strong>More storage options.</strong> Vault storage will be expandable up to 100 GB.</li>\n<li><strong>Bigger files.</strong> Maximum file size is doubling from 100 MB to 200 MB.</li>\n<li><strong>Closer servers.</strong> You can sync faster by choosing your region. Options will include North America, Europe, Asia, and Oceania.</li>\n</ul>\n<p>Starting in January 2024, these will be the new Sync plans:</p>\n<ul>\n<li>10 GB for $10/mo, or $8/mo billed yearly</li>\n<li>100 GB for $20/mo, or $16/mo billed yearly</li>\n</ul>\n<h3>Join Sync now for an early supporter holiday deal</h3>\n<p>If you <a href=\"https://obsidian.md/pricing\">sign up for Obsidian Sync</a> between now and January 1st, 2024, you will get 50 GB of storage for $10/mo or $8/mo billed yearly.</p>\n<p>If you are a current Sync subscriber your plan has automatically been upgraded to 50 GB of flexible storage, 10 vaults, and increased file size limit. Your pricing will not change, including any discounts you have.</p>\n<p>Happy holidays, and thank you for being an early supporter!</p>\n<p>You can <a href=\"https://help.obsidian.md/Licenses+and+payment/Gifting\">gift Sync to your friends and family</a> with this early supporter benefit through the end of the year.</p>\n<h3>About these changes</h3>\n<p>With these new plans, our goal is to continue offering more flexibility and speed while maintaining the price we launched with in 2020.</p>\n<p>As Obsidian has grown beyond <a href=\"https://obsidian.md/blog/new-obsidian-icon/\">a million users</a> we have seen a growing variety in vault sizes and storage needs. Some people prefer one large vault, while others split their work across many vaults. Some people are strict text-only writers, while others love working with images, audio, video, and our <a href=\"https://obsidian.md/changelog/2023-05-09-desktop-v1.3/\">recently improved PDF capabilities</a>. This variety of use cases made it clear that Sync should grow beyond a one-size-fits-all plan.</p>\n<p>Previously, the 5 vault limit and 10 GB per vault made Obsidian Sync too restrictive for some users. By making Sync more flexible we're excited to see what new use cases open up.</p>\n<h3>FAQs</h3>\n<p><strong>Q: As a current user do I need to do anything special to access the new plan and features?</strong><br />\nA: As a current Sync subscriber, your account will be automatically upgraded to 10 vaults with 50 GB of flexible storage. There will be no changes in pricing at your next renewal. All discounts are preserved.</p>\n<p><strong>Q: How do these new plans affect early bird pricing, non-profit, or educational discounts?</strong><br />\nA: Any discounts on your account are still applied to the new plans. Your existing pricing will remain unchanged. If you upgrade to 100 GB of storage you will still benefit from the discounts on your account.</p>\n<p><strong>Q: If I cancel my 50 GB plan can I sign up for it again?</strong><br />\nA: No. If you cancel your 50 GB plan, it will no longer be available to you. Starting in January 2024, you will only have access to the new 10 GB and 100 GB storage options.</p>\n<p><strong>Q: Can I switch between monthly and yearly billing without losing my plan?</strong><br />\nA: Yes. You can switch between monthly and yearly billing (or vice versa) without affecting your plan features or any discount you may have.</p>\n<p><strong>Q: How can I change the server region for my Sync vault?</strong><br />\nA: You can only select a server region when you initially set up Sync. If you need to change servers you'll need to create a new remote vault and re-upload your vault data. Unfortunately you will lose version history if you do so. We do not currently offer a way to migrate your vault to a different region.</p>\n<p><strong>Q: Does the Sync server region affect the security or privacy of my data?</strong><br />\nA: No. Sync uses the same end-to-end encryption and <a href=\"https://help.obsidian.md/Obsidian+Sync/Security+and+privacy\">approach to security and privacy</a> regardless of the server region.</p>\n",
			"date_published": "2023-11-21T00:00:00Z", 
			"author": {
				"name": "kepano"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/goodbye-legacy-editor/",
			"url": "https://obsidian.md/blog/goodbye-legacy-editor/",
			"title": "Goodbye legacy editor",
			"content_html": "<p>In the upcoming Obsidian v1.5, the <em>legacy editor</em> will be removed from the app.</p>\n<p>For plugin developers, this means we will be completely removing CodeMirror 5 and you will be able to assume users on newer versions of Obsidian will be using CodeMirror 6.</p>\n<p>The <em>legacy editor</em> has been a part of Obsidian since the beginning. In Obsidian v0.13, (which we shipped almost 2 years ago!), we completely rewrote the editor to be more robust and more future-proof. This new editor has been the default editing experience since it was introduced; however, the old editor has continued to stick around as an option. Many of Obsidian's first community plugins relied on the legacy editor so we kept it around for compatibility.</p>\n<p><img src=\"https://obsidian.md/images/blog/remove-legacy-editor.png\" alt=\"Obsidian Settings showing legacy editor option\" /></p>\n<p>As we look forward to big and better editing improvements, we've decided it's time to part ways. For most users, you likely won't notice anything different. Longer term, this will make it even easier for us to ship <a href=\"https://obsidian.md/roadmap\">newer and better editing experiences</a>. Of course, source mode will remain an option if you're looking for a strictly plain text experience.</p>\n<p><img src=\"https://obsidian.md/images/blog/table-editing.gif\" alt=\"Table editing experience sneak peek\" /></p>\n",
			"date_published": "2023-11-02T00:00:00Z", 
			"author": {
				"name": "liam"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/apple-notes-export/",
			"url": "https://obsidian.md/blog/apple-notes-export/",
			"title": "Obsidian Importer now converts Apple Notes to portable, durable files",
			"content_html": "<p><a href=\"https://help.obsidian.md/import\">Obsidian Importer</a> allows you to convert your data from a variety of proprietary formats to portable, durable files. These files work with any Markdown app, so you have control over your data, and are not locked into any tool.</p>\n<p>Today we're excited to share that Importer now works with Apple Notes, and is compatible with its many content types — including internal links added in iOS 17. See our guide: <a href=\"https://help.obsidian.md/import/apple-notes\">How to convert your Apple Notes to Obsidian</a>.</p>\n<p>Three months ago, <a href=\"https://obsidian.md/blog/free-your-notes\">we introduced Importer</a> as an <a href=\"https://github.com/obsidianmd/obsidian-importer\">open-source project</a>. Thanks to contributions from the Obsidian community, Importer supports converting your data from <a href=\"https://help.obsidian.md/import/notion\">Notion</a>, <a href=\"https://help.obsidian.md/import/evernote\">Evernote</a>, <a href=\"https://help.obsidian.md/import/google-keep\">Google Keep</a>, <a href=\"https://help.obsidian.md/import/onenote\">Microsoft OneNote</a>, <a href=\"https://help.obsidian.md/import/bear\">Bear</a>, <a href=\"https://help.obsidian.md/import/roam\">Roam Research</a>, <a href=\"https://help.obsidian.md/import/html\">HTML files</a>, <a href=\"https://help.obsidian.md/import\">and more</a>.</p>\n<p>The latest version of Importer tackles the most challenging format to date: Apple Notes.</p>\n<p>Unfortunately, Apple Notes is one of the few note-taking apps that does not have a built-in export feature. Because Apple Notes uses a proprietary format, it makes data complicated to migrate, and nearly impossible to use in conjunction with other tools.</p>\n<p>Apple Notes supports content such as tables, images, drawings, scans, and PDFs. As of iOS 17 it also supports links between notes. This breadth of content makes the conversion process more challenging. Here's the good news: all of these content types can now be extracted using Obsidian Importer.</p>\n<p><img src=\"https://obsidian.md/images/blog/import-apple-notes.png\" alt=\"Obsidian Importer showing Apple Notes import\" /></p>\n<p>So, how does it work? Apple Notes stores your data in a local SQLite database. This data is in an undocumented format, but it's possible to decode how it is stored and convert it. Decoding the Protocol Buffers stored in the Apple Notes database was made possible by <a href=\"https://github.com/threeplanetssoftware/apple_cloud_notes_parser\">the work of Jon Baumann</a> from <a href=\"https://www.ciofecaforensics.com/\">Ciofeca Forensics</a> and its <a href=\"https://github.com/obsidianmd/obsidian-importer/pull/125\">adaptation for Obsidian</a> by <a href=\"https://novov.me/\">Mir Novov</a>.</p>\n<p>Whether you're planning to migrate away from Apple Notes or just want to back up your data, the new Obsidian Importer gives you the freedom to easily convert your Apple Notes to portable, durable files.</p>\n",
			"date_published": "2023-10-19T00:00:00Z", 
			"author": {
				"name": "kepano"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/2023-obsidian-october/",
			"url": "https://obsidian.md/blog/2023-obsidian-october/",
			"title": "Obsidian October 2023",
			"content_html": "<p>Welcome back to Obsidian October! For our third year, we're here to help you complete the community projects that you've been meaning to work on.</p>\n<p>Whether it's a plugin, theme, tool, or template, this is the month to get it across the finish line!</p>\n<p>Join us in the <a href=\"https://discord.gg/obsidianmd\">#obsidian-october-2023</a> Discord channel to collaborate with the Obsidian team and community members. Whether you hit a snag, want some guidance, or are just looking for encouragement, we're excited to help!</p>\n<p>For 2023, we will start our <strong>Gems of the Year</strong> awards competition in early December. So, as Obsidian October unfolds, it's the ideal time to polish your project and release it. This will give the community a chance to play with your creation ahead of our annual awards.</p>\n<p>Time to rock! Join us on <a href=\"https://discord.gg/obsidianmd\">Discord</a> and the <a href=\"https://forum.obsidian.md/t/obsidian-october-2023-daily-progress-and-learnings/68224\">Obsidian Forum</a>.</p>\n",
			"date_published": "2023-09-26T00:00:00Z", 
			"author": {
				"name": "silver"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/free-your-notes/",
			"url": "https://obsidian.md/blog/free-your-notes/",
			"title": "Free your notes",
			"content_html": "<p>Apps come and go, but the files you create should last.</p>\n<p>Today, we are excited to share a new official, <a href=\"https://github.com/obsidianmd/obsidian-importer\">open source</a> plugin for Obsidian called Importer. You can find it <a href=\"https://obsidian.md/plugins?id=obsidian-importer\">in the Plugins directory</a>.</p>\n<p>Our goal for Importer is to make it easy to convert your notes from a variety of formats to <a href=\"https://help.obsidian.md/Editing+and+formatting/Basic+formatting+syntax\">Markdown</a> files that you own and can use with any app that supports plain text files.</p>\n<p>As we state in our <a href=\"https://obsidian.md/about\">Manifesto</a>:</p>\n<blockquote>\n<p>We believe that your data should be future-proof and easily accessible, no matter where you are.</p>\n</blockquote>\n<p>By converting your notes to plain text files, you can take ownership over your data and avoid becoming locked into a specific tool.</p>\n<p><img src=\"https://obsidian.md/images/2023-07-importer.png#border\" alt=\"Obsidian Importer screenshot\" /></p>\n<p>Importer supports converting from a wide variety of apps and formats. These include <a href=\"https://help.obsidian.md/import/apple-notes\">Apple Notes</a>, <a href=\"https://help.obsidian.md/import/notion\">Notion</a>, <a href=\"https://help.obsidian.md/import/evernote\">Evernote</a>, <a href=\"https://help.obsidian.md/import/google-keep\">Google Keep</a>, <a href=\"https://help.obsidian.md/import/onenote\">Microsoft OneNote</a>, <a href=\"https://help.obsidian.md/import/bear\">Bear</a>, <a href=\"https://help.obsidian.md/import/roam\">Roam Research</a>, <a href=\"https://help.obsidian.md/import/html\">HTML files</a>, <a href=\"https://help.obsidian.md/import\">and more</a>.</p>\n<p>Obsidian stores your files in a local folder on your device, so that you always have control over them, even offline.</p>\n",
			"date_published": "2023-07-12T00:00:00Z", 
			"author": {
				"name": "kepano"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/verify-obsidian-sync-encryption/",
			"url": "https://obsidian.md/blog/verify-obsidian-sync-encryption/",
			"title": "How to verify Obsidian Sync&#39;s end-to-end encryption",
			"content_html": "<p>On our <a href=\"https://obsidian.md/\">About page</a>, we describe the guiding principles that have shaped Obsidian since the start. Privacy is one of these principles, and we go to great lengths to make sure we can uphold this statement:</p>\n<blockquote>\n<p>We believe that your thoughts and ideas belong to you and deserve complete privacy. That's why your data is stored on your device, inaccessible to us. When you use our online services, your data is protected with end-to-end encryption for maximum security.</p>\n</blockquote>\n<p>When you use <a href=\"https://obsidian.md/sync\">Obsidian Sync</a>, your data is end-to-end encrypted. But how can you be sure that is true?</p>\n<p>In this guide, we provide step-by-step instructions so that you can trustlessly verify the end-to-end encryption of your data when it is sent and received via our Sync servers.</p>\n<h3>How Obsidian Sync works</h3>\n<p>Let's review how Obsidian Sync encryption works:</p>\n<ol>\n<li>You provide a vault password, or let our managed server generate one for you. This password is separate from your account password and is only used for establishing a remote vault.</li>\n<li>The Obsidian app generates a unique <a href=\"https://en.wikipedia.org/wiki/Salt_(cryptography)\">salt</a> for each vault. A salt is random data used to protect your password by mixing it with your password before hashing.</li>\n<li>Your encryption key is derived from your password + salt using an algorithm called <a href=\"https://en.wikipedia.org/wiki/Scrypt\">scrypt</a>.</li>\n<li>This encryption key is used to encrypt/decrypt data with <a href=\"https://en.wikipedia.org/wiki/Advanced_Encryption_Standard\">AES-256</a> using <a href=\"https://en.wikipedia.org/wiki/Galois/Counter_Mode\">Galois/Counter Mode</a>.</li>\n</ol>\n<p>In the next few steps, you'll learn how to get your vault's salt, and test the encryption of your data.</p>\n<h3>Getting your vault's salt</h3>\n<p>First, get the salt used to derive your encryption key by following these steps:</p>\n<ol>\n<li>Make sure that Obsidian Sync is turned on.</li>\n<li>Open Developer Tools in the Obsidian app using the hotkey <kbd>Cmd+Opt+I</kbd> on macOS or <kbd>Ctrl+Shift+I</kbd> on Windows.</li>\n<li>Go to the Console and run the following code, by copy/pasting it and pressing the Return key:</li>\n</ol>\n<pre><code class=\"language-js\">let data = await (await fetch('https://api.obsidian.md/vault/list', {method:'POST', headers: {'Content-Type':'application/json'}, body: JSON.stringify({token: JSON.parse(localStorage.getItem('obsidian-account')).token})})).json();\nlet vaults = [].concat(data.shared, data.vaults);\nlet vault = vaults.find(v =&gt; v.id === app.internalPlugins.getEnabledPluginById('sync').vaultId);\nconsole.log(`The salt of your vault ${vault.name} is: &quot;${vault.salt}&quot;`);\n</code></pre>\n<p>You should see a message containing your salt:</p>\n<pre><code>The salt of your vault Notes is: &quot;8II2%?YeNpddlbd@4Z)c&quot;\n</code></pre>\n<h3>Decrypting data</h3>\n<p>Next, find an example of a sync event and decrypt it. Here we will use the Network tab of Developers Tools. This is where all sync events are logged, so you can see data that is being sent and received by the Obsidian app, and confirm that it is using your encryption key.</p>\n<ol>\n<li>Go to the Network tab of the Developer Tools, and filter by &quot;WS&quot; types (for <a href=\"https://en.wikipedia.org/wiki/WebSocket\">WebSocket</a>).</li>\n<li>Find the WebSocket connection to Obsidian Sync. It will look like <code>sync-xx.obsidian.md</code> — you may need to reload Obsidian to see it.</li>\n<li>In the WebSocket data stream, go to the Message tab. There you will see binary messages of uploads and downloads. If you aren't seeing them, you can easily trigger one by modifying any synced note in your vault.</li>\n<li>Right click on one of them and choose <code>Copy message &gt; Copy as Base64</code>.</li>\n<li>Using the following code, enter your password, your salt, and base64 binary data, and run the decryption routine in the Console (alternatively you can run it in a NodeJS prompt or script).</li>\n</ol>\n<pre><code class=\"language-js\">// Use the standard crypto package from NodeJS\nlet crypto = require('crypto');\n\n// Enter your password, salt, and binary data as base64\nlet password = 'E@QAXVBo44PQtzS6EAyU';\nlet salt = '8II2%?YeNpddlbd@4Z)c';\nlet data = Buffer.from('ApLmsQVGwGHmjb7jM4G2ZXnl2+Wi8CJMZSbgCTvcBHendXw01iNw3oWQ8Y8gW1tS7f/OMly1n4KoNhjy', 'base64');\n\n// Derive the encryption/decryption key from your password and salt\nlet key = crypto.scryptSync(Buffer.from(password.normalize('NFKC'), 'utf8'), Buffer.from(salt.normalize('NFKC'), 'utf8'),\n  32, {N: 32768, r: 8, p: 1, maxmem: 128 * 32768 * 8 * 2});\n\n// Split up the data blob into the 12-bytes IV, the encrypted data, and the 16-bytes auth tag.\nlet iv = data.subarray(0, 12);\nlet encryptedData = data.subarray(12, data.length - 16);\nlet authTag = data.subarray(data.length - 16);\n\n// Decrypt the data\nlet decipher = crypto.createDecipheriv('aes-256-gcm', key, iv);\ndecipher.setAuthTag(authTag);\nlet decrypted = Buffer.concat([decipher.update(encryptedData), decipher.final()]);\n\n// Print it to a string\nconsole.log(decrypted.toString('utf8'));\n</code></pre>\n<p>The data that is returned should be a revision of a file that was sent or received via the Obsidian Sync's servers. That's it! If it properly decrypts, you'll know your encryption key is working.</p>\n",
			"date_published": "2023-06-05T00:00:00Z", 
			"author": {
				"name": "licat"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/new-obsidian-icon/",
			"url": "https://obsidian.md/blog/new-obsidian-icon/",
			"title": "The new Obsidian icon",
			"content_html": "<p>Since we started three years ago, we've built Obsidian on <a href=\"https://obsidian.md/about\">core principles</a> that continue to motivate everything we do.</p>\n<p>We've been encouraged to see that these principles are resonating. Obsidian is rounding the corner on 1,000 community plugins, 100,000 Discord members, and 1 million downloads on our latest release!</p>\n<p>As we celebrate this milestone, we're thrilled to introduce a new logo and app icon that reflects <a href=\"https://obsidian.md/about\">Obsidian’s values</a>, and can continue to inspire the community going forward.</p>\n<p>Say hello to the new Obsidian app icon:</p>\n<div class=\"py-16\">\n<a class=\"logo-shimmer\" href=\"https://obsidian.md/\">\n<div class=\"mx-auto card card-logo card-shimmer flex items-center justify-center bg-secondary rounded-[20%] w-48 h-48 lg:w-64 lg:h-64 shadow-2xl hover:shadow-3xl\">\n<img src=\"https://obsidian.md/images/obsidian-logo-gradient.svg\" width=\"85%\" height=\"85%\" alt=\"Obsidian\" class=\"sm:hidden\" />\n<svg fill=\"none\" class=\"hidden sm:inline-block\" height=\"100%\" width=\"100%\" viewBox=\"0 0 512 512\" xmlns=\"http://www.w3.org/2000/svg\">\n\t<radialGradient id=\"logo-bottom-left\" cx=\"0\" cy=\"0\" gradientTransform=\"matrix(-59 -225 150 -39 161.4 470)\" gradientUnits=\"userSpaceOnUse\" r=\"1\">\n\t\t<stop offset=\"0\" stop-color=\"#fff\" stop-opacity=\".4\"></stop>\n\t\t<stop offset=\"1\" stop-opacity=\".1\"></stop>\n\t</radialGradient>\n\t<radialGradient id=\"logo-top-right\" cx=\"0\" cy=\"0\" gradientTransform=\"matrix(50 -379 280 37 360 374.2)\" gradientUnits=\"userSpaceOnUse\" r=\"1\">\n\t\t<stop offset=\"0\" stop-color=\"#fff\" stop-opacity=\".6\"></stop>\n\t\t<stop offset=\"1\" stop-color=\"#fff\" stop-opacity=\".1\"></stop>\n\t</radialGradient>\n\t<radialGradient id=\"logo-top-left\" cx=\"0\" cy=\"0\" gradientTransform=\"matrix(69 -319 218 47 175.4 307)\" gradientUnits=\"userSpaceOnUse\" r=\"1\">\n\t\t<stop offset=\"0\" stop-color=\"#fff\" stop-opacity=\".8\"></stop>\n\t\t<stop offset=\"1\" stop-color=\"#fff\" stop-opacity=\".4\"></stop>\n\t</radialGradient>\n\t<radialGradient id=\"logo-bottom-right\" cx=\"0\" cy=\"0\" gradientTransform=\"matrix(-96 -163 187 -111 335.3 512.2)\" gradientUnits=\"userSpaceOnUse\" r=\"1\">\n\t\t<stop offset=\"0\" stop-color=\"#fff\" stop-opacity=\".3\"></stop>\n\t\t<stop offset=\"1\" stop-opacity=\".3\"></stop>\n\t</radialGradient>\n\t<radialGradient id=\"logo-top-edge\" cx=\"0\" cy=\"0\" gradientTransform=\"matrix(-36 166 -112 -24 310 128.2)\" gradientUnits=\"userSpaceOnUse\" r=\"1\">\n\t\t<stop offset=\"0\" stop-color=\"#fff\" stop-opacity=\"0\"></stop>\n\t\t<stop offset=\"1\" stop-color=\"#fff\" stop-opacity=\".2\"></stop>\n\t</radialGradient>\n\t<radialGradient id=\"logo-left-edge\" cx=\"0\" cy=\"0\" gradientTransform=\"matrix(88 89 -190 187 111 220.2)\" gradientUnits=\"userSpaceOnUse\" r=\"1\">\n\t\t<stop offset=\"0\" stop-color=\"#fff\" stop-opacity=\".2\"></stop>\n\t\t<stop offset=\"1\" stop-color=\"#fff\" stop-opacity=\".4\"></stop>\n\t</radialGradient>\n\t<radialGradient id=\"logo-bottom-edge\" cx=\"0\" cy=\"0\" gradientTransform=\"matrix(9 130 -276 20 215 284)\" gradientUnits=\"userSpaceOnUse\" r=\"1\">\n\t\t<stop offset=\"0\" stop-color=\"#fff\" stop-opacity=\".2\"></stop>\n\t\t<stop offset=\"1\" stop-color=\"#fff\" stop-opacity=\".3\"></stop>\n\t</radialGradient>\n\t<radialGradient id=\"logo-middle-edge\" cx=\"0\" cy=\"0\" gradientTransform=\"matrix(-198 -104 327 -623 400 399.2)\" gradientUnits=\"userSpaceOnUse\" r=\"1\">\n\t\t<stop offset=\"0\" stop-color=\"#fff\" stop-opacity=\".2\"></stop>\n\t\t<stop offset=\".5\" stop-color=\"#fff\" stop-opacity=\".2\"></stop>\n\t\t<stop offset=\"1\" stop-color=\"#fff\" stop-opacity=\".3\"></stop>\n\t</radialGradient>\n\t<clipPath id=\"clip\">\n\t\t<path d=\"M.2.2h512v512H.2z\"></path>\n\t</clipPath>\n\t<g clip-path=\"url(#clip)\">\n\t\t<path d=\"M382.3 475.6c-3.1 23.4-26 41.6-48.7 35.3-32.4-8.9-69.9-22.8-103.6-25.4l-51.7-4a34 34 0 0 1-22-10.2l-89-91.7a34 34 0 0 1-6.7-37.7s55-121 57.1-127.3c2-6.3 9.6-61.2 14-90.6 1.2-7.9 5-15 11-20.3L248 8.9a34.1 34.1 0 0 1 49.6 4.3L386 125.6a37 37 0 0 1 7.6 22.4c0 21.3 1.8 65 13.6 93.2 11.5 27.3 32.5 57 43.5 71.5a17.3 17.3 0 0 1 1.3 19.2 1494 1494 0 0 1-44.8 70.6c-15 22.3-21.9 49.9-25 73.1z\" fill=\"#6c31e3\"></path>\n\t\t<path d=\"M165.9 478.3c41.4-84 40.2-144.2 22.6-187-16.2-39.6-46.3-64.5-70-80-.6 2.3-1.3 4.4-2.2 6.5L60.6 342a34 34 0 0 0 6.6 37.7l89.1 91.7a34 34 0 0 0 9.6 7z\" fill=\"url(#logo-bottom-left)\"></path>\n\t\t<path d=\"M278.4 307.8c11.2 1.2 22.2 3.6 32.8 7.6 34 12.7 65 41.2 90.5 96.3 1.8-3.1 3.6-6.2 5.6-9.2a1536 1536 0 0 0 44.8-70.6 17 17 0 0 0-1.3-19.2c-11-14.6-32-44.2-43.5-71.5-11.8-28.2-13.5-72-13.6-93.2 0-8.1-2.6-16-7.6-22.4L297.6 13.2a34 34 0 0 0-1.5-1.7 96 96 0 0 1 2 54 198.3 198.3 0 0 1-17.6 41.3l-7.2 14.2a171 171 0 0 0-19.4 71c-1.2 29.4 4.8 66.4 24.5 115.8z\" fill=\"url(#logo-top-right)\"></path>\n\t\t<path d=\"M278.4 307.8c-19.7-49.4-25.8-86.4-24.5-115.9a171 171 0 0 1 19.4-71c2.3-4.8 4.8-9.5 7.2-14.1 7.1-13.9 14-27 17.6-41.4a96 96 0 0 0-2-54A34.1 34.1 0 0 0 248 9l-105.4 94.8a34.1 34.1 0 0 0-10.9 20.3l-12.8 85-.5 2.3c23.8 15.5 54 40.4 70.1 80a147 147 0 0 1 7.8 24.8c28-6.8 55.7-11 82.1-8.3z\" fill=\"url(#logo-top-left)\"></path>\n\t\t<path d=\"M333.6 511c22.7 6.2 45.6-12 48.7-35.4a187 187 0 0 1 19.4-63.9c-25.6-55-56.5-83.6-90.4-96.3-36-13.4-75.2-9-115 .7 8.9 40.4 3.6 93.3-30.4 162.2 4 1.8 8.1 3 12.5 3.3 0 0 24.4 2 53.6 4.1 29 2 72.4 17.1 101.6 25.2z\" fill=\"url(#logo-bottom-right)\"></path>\n\t\t<g clip-rule=\"evenodd\" fill-rule=\"evenodd\">\n\t\t\t<path d=\"M254.1 190c-1.3 29.2 2.4 62.8 22.1 112.1l-6.2-.5c-17.7-51.5-21.5-78-20.2-107.6a174.7 174.7 0 0 1 20.4-72c2.4-4.9 8-14.1 10.5-18.8 7.1-13.7 11.9-21 16-33.6 5.7-17.5 4.5-25.9 3.8-34.1 4.6 29.9-12.7 56-25.7 82.4a177.1 177.1 0 0 0-20.7 72z\" fill=\"url(#logo-top-edge)\"></path>\n\t\t\t<path d=\"M194.3 293.4c2.4 5.4 4.6 9.8 6 16.5L195 311c-2.1-7.8-3.8-13.4-6.8-20-17.8-42-46.3-63.6-69.7-79.5 28.2 15.2 57.2 39 75.7 81.9z\" fill=\"url(#logo-left-edge)\"></path>\n\t\t\t<path d=\"M200.6 315.1c9.8 46-1.2 104.2-33.6 160.9 27.1-56.2 40.2-110.1 29.3-160z\" fill=\"url(#logo-bottom-edge)\"></path>\n\t\t\t<path d=\"M312.5 311c53.1 19.9 73.6 63.6 88.9 100-19-38.1-45.2-80.3-90.8-96-34.8-11.8-64.1-10.4-114.3 1l-1.1-5c53.2-12.1 81-13.5 117.3 0z\" fill=\"url(#logo-middle-edge)\"></path>\n\t\t</g>\n\t</g>\n</svg>\n</div>\n</a>\n</div>\n<h3>To make something that lasts, look to the past</h3>\n<p>The new Obsidian icon is inspired by its namesake, the volcanic rock which has been used since the dawn of humanity to make arrowheads, scrapers, knives, and other tools.</p>\n<p>We want to make it possible for your digital notes to be preserved for generations to come. While we can't predict how computers and digital information will evolve in the future, the new icon is a reminder that we can look to the past for inspiration.</p>\n<p>Obsidian notes are stored in simple, plain text files, which have been in use since the dawn of <em>computing</em>. If you want your writing to still be readable on a computer from the 2060s or 2160s, we think it's important that your Obsidian notes can be read on a computer from the 1960s.</p>\n<p><img src=\"https://obsidian.md/images/2023-06-logo-reductions.png\" alt=\"Obsidian logo reduced to single color\" /></p>\n<p>The new logo is designed to remain legible when reduced to single color applications — because it too should have looked groovy in the 60s.</p>\n<h3>Sharpen your thinking</h3>\n<p>Extending the metaphor of obsidian tools, our ambition is for Obsidian to be the tool that helps you think more clearly. As a material, obsidian is shaped using a technique called <a href=\"https://en.wikipedia.org/wiki/Knapping\">knapping</a>, chipping off flakes of rock to create sharp edges.</p>\n<p>Obsidian aims to help you hone your thoughts and refine your ideas with precision. The new icon represents a practical, user-friendly tool that helps you cut through the clutter and carve out clear ideas.</p>\n<h3>You shape your tools, and they shape you</h3>\n<p>We believe that Obsidian should adapt to your way of thinking, not the other way around. That's why we focus on making Obsidian highly customizable and extensible, so you can shape it to your unique needs.</p>\n<p>Like the app itself, the new Obsidian icon is malleable. It can be personalized to reflect your favorite color scheme. With our <a href=\"https://obsidian.md/brand\">customizable vector files</a>, you can tailor the Obsidian icon to your liking. Give it a try!</p>\n<div class=\"card card-logo my-16 mx-auto flex items-center justify-center rounded-[20%] w-48 h-48 lg:w-64 lg:h-64\"> \n<svg id=\"custom-logo\" width=\"512\" height=\"512\" viewBox=\"0 0 512 512\" fill=\"none\" xmlns=\"http://www.w3.org/2000/svg\" style=\"height:100%;width:100%;\">\n  <defs>\n    <radialGradient id=\"b\" cx=\"0\" cy=\"0\" r=\"1\" gradientUnits=\"userSpaceOnUse\" gradientTransform=\"matrix(-48 -185 123 -32 179 429.7)\">\n      <stop stop-color=\"#fff\" stop-opacity=\".4\"></stop>\n      <stop offset=\"1\" stop-opacity=\".1\"></stop>\n    </radialGradient>\n    <radialGradient id=\"c\" cx=\"0\" cy=\"0\" r=\"1\" gradientUnits=\"userSpaceOnUse\" gradientTransform=\"matrix(41 -310 229 30 341.6 351.3)\">\n      <stop stop-color=\"#fff\" stop-opacity=\".6\"></stop>\n      <stop offset=\"1\" stop-color=\"#fff\" stop-opacity=\".1\"></stop>\n    </radialGradient>\n    <radialGradient id=\"d\" cx=\"0\" cy=\"0\" r=\"1\" gradientUnits=\"userSpaceOnUse\" gradientTransform=\"matrix(57 -261 178 39 190.5 296.3)\">\n      <stop stop-color=\"#fff\" stop-opacity=\".8\"></stop>\n      <stop offset=\"1\" stop-color=\"#fff\" stop-opacity=\".4\"></stop>\n    </radialGradient>\n    <radialGradient id=\"e\" cx=\"0\" cy=\"0\" r=\"1\" gradientUnits=\"userSpaceOnUse\" gradientTransform=\"matrix(-79 -133 153 -90 321.4 464.2)\">\n      <stop stop-color=\"#fff\" stop-opacity=\".3\"></stop>\n      <stop offset=\"1\" stop-opacity=\".3\"></stop>\n    </radialGradient>\n    <radialGradient id=\"f\" cx=\"0\" cy=\"0\" r=\"1\" gradientUnits=\"userSpaceOnUse\" gradientTransform=\"matrix(-29 136 -92 -20 300.7 149.9)\">\n      <stop stop-color=\"#fff\" stop-opacity=\"0\"></stop>\n      <stop offset=\"1\" stop-color=\"#fff\" stop-opacity=\".2\"></stop>\n    </radialGradient>\n    <radialGradient id=\"g\" cx=\"0\" cy=\"0\" r=\"1\" gradientUnits=\"userSpaceOnUse\" gradientTransform=\"matrix(72 73 -155 153 137.8 225.2)\">\n      <stop stop-color=\"#fff\" stop-opacity=\".2\"></stop>\n      <stop offset=\"1\" stop-color=\"#fff\" stop-opacity=\".4\"></stop>\n    </radialGradient>\n    <radialGradient id=\"h\" cx=\"0\" cy=\"0\" r=\"1\" gradientUnits=\"userSpaceOnUse\" gradientTransform=\"matrix(20 118 -251 43 215.1 273.7)\">\n      <stop stop-color=\"#fff\" stop-opacity=\".1\"></stop>\n      <stop offset=\"1\" stop-color=\"#fff\" stop-opacity=\".3\"></stop>\n    </radialGradient>\n    <radialGradient id=\"i\" cx=\"0\" cy=\"0\" r=\"1\" gradientUnits=\"userSpaceOnUse\" gradientTransform=\"matrix(-162 -85 268 -510 374.4 371.7)\">\n      <stop stop-color=\"#fff\" stop-opacity=\".2\"></stop>\n      <stop offset=\".5\" stop-color=\"#fff\" stop-opacity=\".2\"></stop>\n      <stop offset=\"1\" stop-color=\"#fff\" stop-opacity=\".3\"></stop>\n    </radialGradient>\n    <filter id=\"a\" x=\"80.1\" y=\"37\" width=\"351.1\" height=\"443.2\" filterUnits=\"userSpaceOnUse\" color-interpolation-filters=\"sRGB\">\n      <feFlood flood-opacity=\"0\" result=\"BackgroundImageFix\"></feFlood>\n      <feBlend in=\"SourceGraphic\" in2=\"BackgroundImageFix\" result=\"shape\"></feBlend>\n      <feGaussianBlur stdDeviation=\"6.5\" result=\"effect1_foregroundBlur_744_9191\"></feGaussianBlur>\n    </filter>\n  </defs>\n  <rect id=\"logo-bg\" fill=\"#262626\" width=\"512\" height=\"512\" rx=\"100\"></rect>\n  <g filter=\"url(#a)\">\n    <path d=\"M359.2 437.5c-2.6 19-21.3 33.9-40 28.7-26.5-7.2-57.2-18.6-84.8-20.7l-42.4-3.2a28 28 0 0 1-18-8.3l-73-74.8a27.7 27.7 0 0 1-5.4-30.7s45-98.6 46.8-103.7c1.6-5.1 7.8-49.9 11.4-73.9a28 28 0 0 1 9-16.5L249 57.2a28 28 0 0 1 40.6 3.4l72.6 91.6a29.5 29.5 0 0 1 6.2 18.3c0 17.3 1.5 53 11.2 76a301.3 301.3 0 0 0 35.6 58.2 14 14 0 0 1 1 15.6c-6.3 10.7-18.9 31.3-36.6 57.6a142.2 142.2 0 0 0-20.5 59.6Z\" fill=\"#000\" fill-opacity=\".3\"></path>\n  </g>\n  <path id=\"arrow\" d=\"M359.9 434.3c-2.6 19.1-21.3 34-40 28.9-26.4-7.3-57-18.7-84.7-20.8l-42.3-3.2a27.9 27.9 0 0 1-18-8.4l-73-75a27.9 27.9 0 0 1-5.4-31s45.1-99 46.8-104.2c1.7-5.1 7.8-50 11.4-74.2a28 28 0 0 1 9-16.6l86.2-77.5a28 28 0 0 1 40.6 3.5l72.5 92a29.7 29.7 0 0 1 6.2 18.3c0 17.4 1.5 53.2 11.1 76.3a303 303 0 0 0 35.6 58.5 14 14 0 0 1 1.1 15.7c-6.4 10.8-18.9 31.4-36.7 57.9a143.3 143.3 0 0 0-20.4 59.8Z\" fill=\"#6C31E3\"></path>\n  <path d=\"M182.7 436.4c33.9-68.7 33-118 18.5-153-13.2-32.4-37.9-52.8-57.3-65.5-.4 1.9-1 3.7-1.8 5.4L96.5 324.8a27.9 27.9 0 0 0 5.5 31l72.9 75c2.3 2.3 5 4.2 7.8 5.6Z\" fill=\"url(#b)\"></path>\n  <path d=\"M274.9 297c9.1.9 18 2.9 26.8 6.1 27.8 10.4 53.1 33.8 74 78.9 1.5-2.6 3-5.1 4.6-7.5a1222 1222 0 0 0 36.7-57.9 14 14 0 0 0-1-15.7 303 303 0 0 1-35.7-58.5c-9.6-23-11-58.9-11.1-76.3 0-6.6-2.1-13.1-6.2-18.3l-72.5-92-1.2-1.5c5.3 17.5 5 31.5 1.7 44.2-3 11.8-8.6 22.5-14.5 33.8-2 3.8-4 7.7-5.9 11.7a140 140 0 0 0-15.8 58c-1 24.2 3.9 54.5 20 95Z\" fill=\"url(#c)\"></path>\n  <path d=\"M274.8 297c-16.1-40.5-21-70.8-20-95 1-24 8-42 15.8-58l6-11.7c5.8-11.3 11.3-22 14.4-33.8a78.5 78.5 0 0 0-1.7-44.2 28 28 0 0 0-39.4-2l-86.2 77.5a28 28 0 0 0-9 16.6L144.2 216c0 .7-.2 1.3-.3 2 19.4 12.6 44 33 57.3 65.3 2.6 6.4 4.8 13.1 6.4 20.4a200 200 0 0 1 67.2-6.8Z\" fill=\"url(#d)\"></path>\n  <path d=\"M320 463.2c18.6 5.1 37.3-9.8 39.9-29a153 153 0 0 1 15.9-52.2c-21-45.1-46.3-68.5-74-78.9-29.5-11-61.6-7.3-94.2.6 7.3 33.1 3 76.4-24.8 132.7 3.1 1.6 6.6 2.5 10.1 2.8l43.9 3.3c23.8 1.7 59.3 14 83.2 20.7Z\" fill=\"url(#e)\"></path>\n  <path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M255 200.5c-1.1 24 1.9 51.4 18 91.8l-5-.5c-14.5-42.1-17.7-63.7-16.6-88 1-24.3 8.9-43 16.7-59 2-4 6.6-11.5 8.6-15.3 5.8-11.3 9.7-17.2 13-27.5 4.8-14.4 3.8-21.2 3.2-28 3.7 24.5-10.4 45.8-21 67.5a145 145 0 0 0-17 59Z\" fill=\"url(#f)\"></path>\n  <path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M206 285.1c2 4.4 3.7 8 4.9 13.5l-4.3 1c-1.7-6.4-3-11-5.5-16.5-14.6-34.3-38-52-57-65 23 12.4 46.7 31.9 61.9 67Z\" fill=\"url(#g)\"></path>\n  <path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M211.1 303c8 37.5-1 85.2-27.5 131.6 22.2-46 33-90.1 24-131l3.5-.7Z\" fill=\"url(#h)\"></path>\n  <path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M302.7 299.5c43.5 16.3 60.3 52 72.8 81.9-15.5-31.2-37-65.7-74.4-78.5-28.4-9.8-52.4-8.6-93.5.7l-.9-4c43.6-10 66.4-11.2 96 0Z\" fill=\"url(#i)\"></path>\n</svg>\n</div>\n<div class=\"flex text-center mx-auto justify-center items-center\">\n\t<input type=\"color\" value=\"#262626\" id=\"logo-bg-input\" class=\"cursor-pointer p-0 rounded-full mr-4\" />\n\t<input type=\"color\" value=\"#6c31e3\" id=\"arrow-input\" class=\"cursor-pointer p-0 rounded-full mr-4\" />\n\t<button title=\"Reset\" id=\"reset-button\" class=\"font-medium text-sm text-muted p-2 mr-1 rounded hover:bg-secondary hover:text-white\"><i icon-name=\"rotate-ccw\" class=\"icon-xl sm:icon-lg\"></i></button>\n\t<button title=\"Shuffle\" id=\"randomize-button\" class=\"font-medium text-sm text-muted p-2 mr-1 rounded hover:bg-secondary hover:text-white\"><i icon-name=\"shuffle\" class=\"icon-xl sm:icon-lg\"></i></button>\n</div>\n<div class=\"flex justify-center items-center text-center mx-auto mt-4 mb-16\">\n\t<div class=\"p-1 border rounded border-gray-800 flex items-center\">\n\t\t<span class=\"font-medium sm:text-base text-normal mr-2 pl-2\">Save to</span>\n\t\t<button id=\"save-button-png\" class=\"font-medium sm:text-base text-accent py-1 px-2 rounded hover:bg-accent-700 hover:text-white\">PNG</button>\n\t\t<button id=\"save-button-svg\" class=\"font-medium sm:text-base text-accent py-1 px-2 rounded hover:bg-accent-700 hover:text-white\">SVG</button>\n\t\t<button id=\"save-button-ico\" class=\"font-medium sm:text-base text-accent py-1 px-2 rounded hover:bg-accent-700 hover:text-white\">ICO</button>\n\t\t<button id=\"save-button-icns\" class=\"font-medium sm:text-base text-accent py-1 px-2 rounded hover:bg-accent-700 hover:text-white\">ICNS</button>\n\t</div>\n</div>\n<div class=\"mt-8 flex text-center text-base mx-auto gap-4 justify-center items-center hidden\">\n\t<select id=\"color-presets\">\n\t\t<option value=\"#262626\" data-arrow=\"#6c31e3\" data-background=\"#262626\">Default (dark)</option>\n\t\t<option value=\"#6c31e3\" data-arrow=\"#6c31e3\" data-background=\"#FFFFFF\">Default (light)</option>\n\t\t<option value=\"#7e52bc\" data-arrow=\"#7e52bc\" data-background=\"#282a37\">Dracula</option>\n\t\t<option value=\"#8DA102\" data-arrow=\"#8DA102\" data-background=\"#323B43\">Everforest</option>\n\t\t<option value=\"#D65D0D\" data-arrow=\"#D65D0D\" data-background=\"#282828\">Gruvbox</option>\n\t\t<option value=\"#5E81AC\" data-arrow=\"#5E81AC\" data-background=\"#2E3440\">Nord</option>\n\t\t<option value=\"#002B36\" data-arrow=\"#839497\" data-background=\"#002B36\">Solarized</option>\n\t</select>\n</div>\n<p>Our new icon and branding was created internally. Thank you to everyone who provided feedback along the way!</p>\n<p>You will see the new icon by <a href=\"https://obsidian.md/download\">downloading</a> the latest version of Obsidian. We've also polished the website, and added two new sections, the <a href=\"https://obsidian.md/blog\">Blog</a> and <a href=\"https://obsidian.md/changelog\">Changelog</a>.</p>\n<script src=\"https://obsidian.md/logogen.js\"></script>\n",
			"date_published": "2023-06-01T00:00:00Z", 
			"author": {
				"name": "kepano"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/new-documentation-site/",
			"url": "https://obsidian.md/blog/new-documentation-site/",
			"title": "New developer documentation site",
			"content_html": "<p>Are you building a plugin or theme for Obsidian?</p>\n<p>Today we're launching our new Developer Documentation: <a href=\"https://docs.obsidian.md/\">docs.obsidian.md</a></p>\n<p>Learn how to get started and how to polish an existing project, using our new resources for developers.</p>\n<p>Here are a few of the things you can find in the new docs:</p>\n<ul>\n<li><strong>Tutorials</strong> for how to get started with plugin and theme development.</li>\n<li><strong>Reference docs</strong> for both our plugin API and CSS variables</li>\n<li><strong>Guidelines</strong> for how to publish your project to the Obsidian catalog.</li>\n</ul>\n<p>We look forward to hearing what you think, and to continuing to improve the docs with more developer content!</p>\n<p>Visit <a href=\"https://docs.obsidian.md/\">docs.obsidian.md</a> to get started.</p>\n",
			"date_published": "2023-04-27T00:00:00Z", 
			"author": {
				"name": "marcusolsson"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/obsidian-publish-now-offers-more-for-less/",
			"url": "https://obsidian.md/blog/obsidian-publish-now-offers-more-for-less/",
			"title": "Obsidian Publish now offers more for less: a lower price, with new features, improved SEO and accessibility",
			"content_html": "<p>We're excited to announce changes that make <a href=\"https://obsidian.md/publish\">Obsidian Publish</a> even better for hosting your wiki, knowledge base, documentation, or digital garden.</p>\n<h3>What's new?</h3>\n<ul>\n<li>50% lower price. Publish now costs the same as <a href=\"https://obsidian.md/sync\">Sync</a> at $96 per year, or $10 per month (USD)</li>\n<li>Faster and more accessible. Publish now has near 100% Lighthouse scores on performance, SEO, accessibility, and best practices</li>\n<li>Improved search engine indexing</li>\n<li>Pretty social sharing cards, customizable using YAML metadata</li>\n<li>Customize which pages appear in the sidebar and in which order</li>\n</ul>\n<p>If you missed it, we also recently released <a href=\"https://forum.obsidian.md/t/publish-theming-guide/54445\">a new default theme for Obsidian Publish</a> that is more accessible and customizable.</p>\n<p>Explore the <a href=\"https://help.obsidian.md/Obsidian+Publish/Introduction+to+Obsidian+Publish\">Obsidian Publish documentation</a> for more details.</p>\n<h3>FAQ</h3>\n<p><strong>Q: Is this a limited time price change?</strong><br />\nA: No, this is the new price for Obsidian Publish starting today.</p>\n<p><strong>Q: How do various discounts work with the new price?</strong><br />\nA: Educational discount, non-profit discount, as well as early bird discount will be applied to the new pricing, just like Sync.</p>\n<p><strong>Q: What happens to my existing Publish subscription?</strong><br />\nA: Your next renewal will automatically switch to the new price, you don't need to do anything.</p>\n",
			"date_published": "2023-04-18T00:00:00Z", 
			"author": {
				"name": "kepano"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/2022-goty-winners/",
			"url": "https://obsidian.md/blog/2022-goty-winners/",
			"title": "2022 Gems of the year winners",
			"content_html": "<p>Results for our 3rd Gems of the Year awards are out!</p>\n<p>We received an overwhelming number of great nominations. For the competitive categories, we let the community vote for their favorites among the most nominated submissions.</p>\n<p>🎉 Thank you to everyone who nominated and voted, and congratulations to the winners!</p>\n<p><em>We will be in touch with winners soon so you can receive your prizes!</em></p>\n<h2>Plugins</h2>\n<h3>Winner</h3>\n<p>🏆 <a href=\"https://github.com/obsidian-tasks-group/obsidian-tasks\">Obsidian Tasks</a> by Martin Schenck and Clare Macrae (<a href=\"https://obsidian-tasks-group.github.io/obsidian-tasks/\">Documentation</a>)</p>\n<blockquote>\n<p>Track tasks across your entire vault. Query them and mark them as done wherever you want. Supports due dates, recurring tasks (repetition), done dates, sub-set of checklist items, and filtering.</p>\n</blockquote>\n<p><a href=\"https://github.com/obsidian-tasks-group/obsidian-tasks\"><img src=\"https://forum.obsidian.md/uploads/default/original/3X/6/f/6f7973320e134c5c674535f238e4c1a1a317149f.png\" alt=\"image|690x476, 75%\" /></a></p>\n<h3>Runners up</h3>\n<p><a href=\"https://github.com/Make-md/makemd\">Make.md</a> by JP Cen</p>\n<blockquote>\n<p>Experience a combination of intuitive and powerful features that helps you keep track and stay focused. Dive right into make.md or see a preview below.</p>\n</blockquote>\n<p><a href=\"https://github.com/RafaelGB/obsidian-db-folder\">Database Folder</a> by Rafael Gómez Bermejo (<a href=\"https://rafaelgb.github.io/obsidian-db-folder/\">Documentation</a>)</p>\n<blockquote>\n<p>This plugin is a Notion like database based on folders, links, tags, or dataview queries.</p>\n</blockquote>\n<h2>Themes</h2>\n<h3>Winner</h3>\n<p>🏆 <a href=\"https://github.com/AnubisNekhet/AnuPpuccin\">AnuPpuccin</a> by Anubis</p>\n<p><a href=\"https://github.com/AnubisNekhet/AnuPpuccin\"><img src=\"https://forum.obsidian.md/uploads/default/original/3X/e/3/e343f2208d01a4a88ff995f06a600a36fc7f9884.jpeg\" alt=\"image|690x464, 75%\" /></a></p>\n<h3>Runners up</h3>\n<p><a href=\"https://github.com/catppuccin/obsidian\">Catppuccin</a> by Marshall Beckrich</p>\n<p><a href=\"https://github.com/catppuccin/obsidian\"><img src=\"https://raw.githubusercontent.com/catppuccin/obsidian/main/assets/screenshot-hq.png\" alt=\"image|690x439, 50%\" /></a></p>\n<p><a href=\"https://github.com/7368697661/Origami\">Origami</a> by kneecaps</p>\n<p><a href=\"https://github.com/7368697661/Origami\"><img src=\"https://forum.obsidian.md/uploads/default/original/3X/b/b/bbc748cbadf4ac049fd74a7cfada27698a6bdee6.png\" alt=\"image|690x370, 50%\" /></a></p>\n<h2>Community</h2>\n<h3>Developers</h3>\n<h3><a href=\"https://github.com/Quorafind\">boninall</a></h3>\n<p>Creator of popular plugins like <a href=\"https://github.com/Quorafind/Obsidian-Memos\">Memos</a> and <a href=\"https://github.com/PKM-er/Obsidian-Surfing\">Surfing</a>.</p>\n<p><a href=\"https://www.buymeacoffee.com/boninall\">♥ Support boninall through Buy Me a Coffee\n</a></p>\n<h3><a href=\"https://github.com/valentine195\">javalent (Jeremy Valentine)</a></h3>\n<p>Creator of popular plugins like <a href=\"https://github.com/valentine195/obsidian-admonition\">Admonition</a> and <a href=\"https://github.com/valentine195/obsidian-leaflet-plugin\">Obsidian Leaflet</a>. Big contributor for the Obsidian TTRPG community.</p>\n<p><a href=\"https://www.buymeacoffee.com/valentine195\">♥ Support javalent through Buy Me a Coffee</a></p>\n<h3><a href=\"https://github.com/zsviczian\">zsviczian (Zsolt Viczián)</a></h3>\n<p>Creator of popular visual plugins like <a href=\"https://github.com/zsviczian/obsidian-excalidraw-plugin\">Obsidian Excalidraw</a> and <a href=\"https://github.com/zsviczian/excalibrain\">Excalibrain</a>. Big proponent of visual thinking and host of the <a href=\"https://www.youtube.com/c/VisualPKM\">Visual PKM</a> channel on YouTube.</p>\n<p><a href=\"https://ko-fi.com/zsolt\">♥ Support zsviczian through Ko-fi</a></p>\n<h3>Discord members</h3>\n<ul>\n<li><a href=\"https://www.eleanorkonik.com/\">Eleanor Konik</a></li>\n<li><a href=\"https://github.com/chrisgrieser\">pseudometa</a></li>\n<li><a href=\"https://github.com/AB1908\">AB1908</a></li>\n</ul>\n<h3>Forum members</h3>\n<ul>\n<li>@justdoitcc</li>\n<li>@CawlinTeffid</li>\n<li>@Craig</li>\n</ul>\n",
			"date_published": "2023-02-21T00:00:00Z", 
			"author": {
				"name": "silver"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/kepano-ceo/",
			"url": "https://obsidian.md/blog/kepano-ceo/",
			"title": "I’m joining Obsidian full-time as CEO",
			"content_html": "<p>A bit of exciting news. I’m joining Obsidian full-time as CEO!</p>\n<p>I have been using Obsidian and developing for it since Silver and Licat first launched in 2020. I can’t overstate how life-changing Obsidian has been for me. It has fundamentally improved the way I think. I want to see what happens if more people gain that superpower.</p>\n<p>Silver and Licat aren’t going anywhere, quite the opposite! As I take on this role, Silver and Licat will have more time to do what they do best — building the amazing product and community we all love.</p>\n<p>You may know me from Minimal and my contributions to Obsidian 1.0, but I’ve spent about 20 years building companies, and learned a lot along the way. Obsidian is built on strong values. My goal is to create the structure that helps us uphold those values for as long as possible.</p>\n<p>Obsidian is, and will continue to be:</p>\n<ul>\n<li>Free for personal use</li>\n<li>Built on durable, open file formats without lock-in</li>\n<li>Private, offline-first, and E2E encrypted</li>\n<li>Endlessly customizable via API/plugins</li>\n</ul>\n<p>Above all, Obsidian is 100% user-supported. There are no investors pushing us to compromise on these values.</p>\n<p>I believe these strong values are why Obsidian has such a kind and dedicated community. It’s genuinely one of the most generous and friendly places online.</p>\n<p>There is nothing I’d rather do than help Obsidian fulfill its potential, and I’m excited to commit myself to it fully.</p>\n",
			"date_published": "2023-02-06T00:00:00Z", 
			"author": {
				"name": "kepano"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/new-code-of-conduct/",
			"url": "https://obsidian.md/blog/new-code-of-conduct/",
			"title": "New Code of Conduct for our community",
			"content_html": "<p>Hi everyone! Our community is almost 3 years old! 🥳</p>\n<p>After basically only having two simple rules (“be nice” and “don’t spam”) for so long, today we’re rolling out <a href=\"https://help.obsidian.md/Obsidian/Community+code+of+conduct\">our official community code of conduct</a>. If you see behaviors described in the code of conduct, please follow the directions to report to our moderators.</p>\n<p>Thanks for keeping our community a nice place for everyone!</p>\n",
			"date_published": "2023-01-23T00:00:00Z", 
			"author": {
				"name": "silver"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/2022-goty-nominations/",
			"url": "https://obsidian.md/blog/2022-goty-nominations/",
			"title": "2022 Gems of the year nominations",
			"content_html": "<p>We’re almost at the end of 2022!</p>\n<p>Time to nominate your favorite projects and people this year in the Obsidian community for the Gems of the Year prizes!</p>\n<p>To nominate go here: <a href=\"https://airtable.com/shrMd4Dj4oLgL55yt\">Gems of the Year 2022 Nomination</a></p>\n<p>Nominations are due on January 15. Looking forward to your nominations!</p>\n<p>Categories you can nominate this year:</p>\n<ul>\n<li>Best plugin</li>\n<li>Best theme</li>\n<li>Most helpful Discord member</li>\n<li>Most helpful forum member</li>\n<li>Most helpful community developer</li>\n<li>Best canvas</li>\n</ul>\n<p>A few words on submission:</p>\n<ul>\n<li>Anyone can nominate, no login or account is required.</li>\n<li>You can nominate yourself or your own project.</li>\n<li>You can submit multiple nominations.</li>\n</ul>\n",
			"date_published": "2022-12-30T00:00:00Z", 
			"author": {
				"name": "silver"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/2022-obsidian-october-winners/",
			"url": "https://obsidian.md/blog/2022-obsidian-october-winners/",
			"title": "Obsidian October 2022 winners",
			"content_html": "<p>Our second Obsidian October has come to a close, and once again we were overwhelmed with all the amazing content, plugins, and themes that the Obsidian community created.</p>\n<p>We received <a href=\"https://airtable.com/shrFnFY00zy1ORZgI/tblP9bDDDDCib7Roy\">84 entries</a>, judged by our panel that included joethei, liam, luke, ryanjamurphy, bri, silver and kepano. In keeping with our “Back to School” theme, a few of the entries were selected by our judges as their 🧑‍🎓 <em>student pick</em>, ideal for anyone in school and academia.</p>\n<p>🎉 Thank you to everyone who participated, and congratulations to the winners!</p>\n<p><em>We will be in touch with winners soon so you can receive your prizes!</em></p>\n<p><a href=\"https://airtable.com/shrFnFY00zy1ORZgI/tblP9bDDDDCib7Roy\">Browse all entries</a></p>\n<h2>New plugin</h2>\n<h3>Winner</h3>\n<p>🏆 <a href=\"https://github.com/marcusolsson/obsidian-projects\">Obsidian Projects</a> by Marcus Olsson</p>\n<blockquote>\n<p><em>Projects</em> is a plugin for Obsidian that lets you manage and visualize notes for project management.</p>\n</blockquote>\n<p><a href=\"https://github.com/marcusolsson/obsidian-projects\"><img src=\"https://forum.obsidian.md/uploads/default/original/3X/a/3/a3685f32c1c2c20f4dd31e3a0a9040a07fbab3d7.png\" alt=\"obsidian-projects-table|690x431\" /></a></p>\n<h3>Runners up</h3>\n<p><a href=\"https://github.com/TfTHacker/obsidian42-strange-new-worlds\">Strange New Worlds</a> by TfT Hacker</p>\n<blockquote>\n<p>Discover the connections of thought in your Obsidian vault. The basic idea is we want to see when links, block references and embeds have associations with other files in the vault. The problem is you have to search, open backlinks and so on to find out what is going on. But there are so many strange new worlds of networked thought to discover in our vault. This plugin attempts to resurface those connections and not be to intrusive (or not too intrusive) in doing so.</p>\n</blockquote>\n<p><a href=\"https://github.com/gtg922r/obsidian-numerals\">Numerals</a> by RyanC</p>\n<blockquote>\n<p><em>Numerals</em> gives you the power of an advanced calculator inside a <code>math</code> code block, complete with currencies, units, variables, and math functions!</p>\n</blockquote>\n<p><a href=\"https://github.com/make-md/makemd\">make.md</a> by JP — 🧑‍🎓 <em>student pick</em></p>\n<blockquote>\n<p><em>Make.md</em> enhances your Obsidian experience with powerful features whether you're a beginner 🚲 or an Obsidian Magician 🪄</p>\n</blockquote>\n<h2>New theme</h2>\n<h3>Winner</h3>\n<p>🏆 <a href=\"https://github.com/7368697661/Origami\">Origami</a> by kneecaps</p>\n<blockquote>\n<p>A playful workhorse theme for Obsidian, inspired by paper and ink</p>\n</blockquote>\n<p><a href=\"https://github.com/7368697661/Origami\"><img src=\"https://forum.obsidian.md/uploads/default/original/3X/f/9/f9392760c33cc784b46b6d7bb0745c0ae8466451.jpeg\" alt=\"image|690x388\" /></a></p>\n<h3>Runners up</h3>\n<p><a href=\"https://github.com/krios2146/obsidian-github\">GitHub theme</a> by krios2146</p>\n<blockquote>\n<p>Theme for Obsidian inspired by GitHub color scheme</p>\n</blockquote>\n<p><a href=\"https://github.com/efemkay/obsidian-listive-theme\">Listive</a> by efemkay</p>\n<blockquote>\n<p>Outliner-focused theme with differentiated header style and subtle interface for atomic notes with insight-based points</p>\n</blockquote>\n<h2>Plugin update</h2>\n<h3>Winner</h3>\n<p>🏆 <a href=\"https://github.com/MohrJonas/obsidian-ocr\">Obsidian-OCR</a> by Jonas Mohr</p>\n<blockquote>\n<p><em>Obsidian OCR</em> allows you to search for text in your images and pdfs</p>\n</blockquote>\n<h3>Runners up</h3>\n<p><a href=\"https://github.com/phibr0/obsidian-commander\">Commander</a> by Johnny &amp; phibr0</p>\n<blockquote>\n<p>Add commands to every part of Obsidian's user interface</p>\n</blockquote>\n<p><a href=\"https://github.com/kevboh/longform\">Longform 2.0</a> by kevboh</p>\n<blockquote>\n<p><em>Longform</em> is a plugin for Obsidian that helps you write and edit novels, screenplays, and other long projects. It lets you organize a series of notes, or <em>scenes</em>, into an ordered manuscript.</p>\n</blockquote>\n<h2>Theme update</h2>\n<h3>Winner</h3>\n<p>🏆 <a href=\"https://github.com/chrisgrieser/shimmering-focus\">Shimmering Focus Rewrite for Obsidian 1.0</a> by pseudometa</p>\n<blockquote>\n<p>A minimalistic and opinionated Obsidian theme for the keyboard-centric user.</p>\n</blockquote>\n<h3>Runners up</h3>\n<p><a href=\"https://github.com/damiankorcz/Prism-Theme/releases/tag/3.0.0\">Prism 3.0.0</a> by Damian Korcz</p>\n<blockquote>\n<p>Prism 3.0.0 is a complete rewrite of the theme to incorporate the changes made by the new Default theme introduced in Obsidian 1.0.0. The theme aims to supports Desktop, Phone and Tablet clients. The theme makes liberal use of the newly introduced variables to help with CSS Snippet compatibility and general overridability of Prism styling.</p>\n</blockquote>\n<p><a href=\"https://github.com/crashmoney/obsidian-typewriter\">Obsidian Typewriter 2.0.0</a> by crashmoney</p>\n<blockquote>\n<p>Typewriter is an Obsidian theme designed for a focused writing experience.</p>\n</blockquote>\n<h2>Written content</h2>\n<h3>Winner</h3>\n<p>🏆 <a href=\"https://www.obsidianroundup.org/the-konik-method-for-making-notes/\">The Konik Method for Making Useful Notes</a> by Eleanor Konik</p>\n<blockquote>\n<p>How to make notes for reference, not self-improvement: A practical guide to messy notes meant to be used, not admired.</p>\n</blockquote>\n<h3>Runners up</h3>\n<p><a href=\"https://betterhumans.pub/how-to-boost-your-productivity-for-scientific-research-using-obsidian-fe85c98c63c8\">How to Boost Your Productivity for Scientific Research Using Obsidian</a> by Leonardo Castorina  — 🧑‍🎓 <em>student pick</em></p>\n<blockquote>\n<p>Tools and workflows for managing your zettelkasten, projects, reading lists, notes, and inspiration during your PhD.</p>\n</blockquote>\n<p><a href=\"https://samgqroberts.com/posts/the-atoms-of-obsidian-md\">The Atoms of Obsidian.md</a> by Sam Roberts</p>\n<blockquote>\n<p>Writing notes on subjects and entities, and writing longer-form publishable Markdown files like this blog post, is really nice in Obsidian. These end up being the atoms of Obsidian, the basic building blocks of the experience and the nodes in the knowledge network graph.</p>\n</blockquote>\n<h2>Video</h2>\n<h3>Winner</h3>\n<p>🏆 <a href=\"https://youtu.be/5Vz59TU115M\">Obsidian Onboarding</a> by Danny Hatcher</p>\n<blockquote>\n<p>This video is part of my Obsidian Onboarding playlist that is on YouTube where I have posted (and will post more) videos during the event, focused on core and community plugin onboarding.</p>\n</blockquote>\n<h3>Runners up</h3>\n<p><a href=\"https://youtu.be/7TECHXQRKWU\">How And Why To Setup A Knowledge Base</a> by DJ Lensing</p>\n<blockquote>\n<p>A knowledge base is a place where information is gathered and organised into what we call knowledge. This lesson is meant to provide some help with the goal of setting up your own personal knowledge base. In practice, this comes down to a mindful approach to note-taking. More on this in the video. Enjoy!</p>\n</blockquote>\n<p><a href=\"https://www.youtube.com/watch?v=saVMgHPTLn0\">How to Turn Your Note-taking Into a Lifelong Learning Workflow with Obsidian</a> by Marcel Samyn</p>\n<blockquote>\n<p>If you're a note-taker like me, you probably learn and write down a TON of stuff. But without a workflow to integrate this into your knowledge as a whole, they just kinda disappear over time and you forget about it. I've been thinking a lot about this lately, and trying to come up with a workflow or framework that gives me the practices to start really remembering what I learn. I also want to use MY OWN notes to generate new insights, and with the tips in this video that seems to be starting out well.</p>\n</blockquote>\n<p><a href=\"https://youtu.be/PuqGjNJMiZQ\">How I Write Conceptual Lecture Notes in Obsidian</a> by Aidan Helfant  — 🧑‍🎓 <em>student pick</em></p>\n<blockquote>\n<p>Most students are never taught how to take effective notes that they can use even after the semester is over. In this video, I discuss how I use Obsidian to take lecture notes that stay make my knowledge unique and stay with me over years and years. I explain the dangers of bad notetaking and how to use my notetaking method, conceptual notemaking, before, during and after class.</p>\n</blockquote>\n<h2>Demo vault</h2>\n<h3>Winner</h3>\n<p>🏆 <a href=\"https://github.com/AnthropologieBiblique/ObsidianTheologicalStudies\">Obsidian for Biblical &amp; Theological Studies</a> by Limezy</p>\n<blockquote>\n<p>This vault is a demo of why we believe Obsidian to be the best tool currently available for exegesis, theological and philosophical studies.</p>\n</blockquote>\n<h3>Runners up</h3>\n<p><a href=\"https://github.com/kinmury/obsidian-miss-w-template\">MISS W</a> by Kinmury  — 🧑‍🎓 <em>student pick</em></p>\n<blockquote>\n<p>Management / Inbox / Slipbox / Source / Workbench\nThis Vault was developed by a user with programming knowledge, a Computer Engineer student to be precise. This means that the design of the vault is affected by the workflow of a programming/engineer student.</p>\n</blockquote>\n<p><a href=\"https://github.com/chris-lovejoy/academic-knowledge-management\">An Academic Knowledge Management System</a> by Chris Lovejoy</p>\n<blockquote>\n<p>The purpose of an academic knowledge management (AKM) system is to enable you to:</p>\n<ol>\n<li>Aggregate and organise academic papers of interest</li>\n<li>Extract and synthesise their key findings and insights</li>\n<li>Combine these insights for a birds-eye view of a research field's cutting edge</li>\n<li>Exporting references and citations when conducting a research project</li>\n</ol>\n</blockquote>\n<hr />\n<p>Congratulations again to all who won and participated!</p>\n",
			"date_published": "2022-12-07T00:00:00Z", 
			"author": {
				"name": "kepano"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/2022-obsidian-october-announcement/",
			"url": "https://obsidian.md/blog/2022-obsidian-october-announcement/",
			"title": "Obsidian October 2022 &quot;Back to School&quot;: make plugins, content, and learn together",
			"content_html": "<p>It’s almost October again, which means it’s time for our second Obsidian October event!</p>\n<p>This year the theme is “Back to School”, for actual students and also students of life. Participate to win cool prizes in any of the categories below:</p>\n<ul>\n<li><strong>New plugin</strong>: a new plugin that you made</li>\n<li><strong>Plugin update</strong>: a significant update of your existing plugin</li>\n<li><strong>Video</strong>: Obsidian related video posted to YouTube or TikTok</li>\n<li><strong>Written content</strong>: Obsidian related written content posted anywhere online</li>\n<li><strong>Demo vault</strong>: a downloadable vault to demonstrate how Obsidian can be used for a specific purpose</li>\n</ul>\n<p>There will be special prizes for creations that are most helpful to students as well.</p>\n<p>Even if you don’t win, you’ll get to create something of your own and have a chance to be one of 3 lucky winners for each category!</p>\n<p>Read more about the event <a href=\"https://publish.obsidian.md/hub/Obsidian+October+2022\">on the Obsidian Hub</a>.</p>\n<p>Share your progress and learnings <a href=\"https://forum.obsidian.md/t/obsidian-october-2022-daily-progress-and-learnings/43767\">on the forum</a>.</p>\n",
			"date_published": "2022-09-23T00:00:00Z", 
			"author": {
				"name": "silver"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/1-0-theme-migration-guide/",
			"url": "https://obsidian.md/blog/1-0-theme-migration-guide/",
			"title": "1.0 Theme migration guide",
			"content_html": "<h2>Overview</h2>\n<p>Obsidian 1.0 introduces a new default theme, a new theme versioning system, and several important new features. We expect that most themes and plugins will need some tweaks.</p>\n<ul>\n<li>Migrating your theme to the new versioning system</li>\n<li>How to design themes for v1.0+</li>\n<li>New v1.0 features and modes to consider</li>\n<li>Design guidelines</li>\n</ul>\n<h2>Migrating your theme to the new versioning system</h2>\n<p>Because v1.0 contains a lot of breaking changes, we are taking this time to reset our theme gallery and improve how themes are loaded in Obsidian going forward.</p>\n<p>Themes that are not compatible with v1.0 have been flagged in the <code>community-css-themes.json</code> file as &quot;legacy.&quot; Legacy themes are hidden from the gallery until the theme author updates the theme opts to have the flag removed.</p>\n<p>Even if your theme made the cut to the new list, we still recommend you take the following steps to prepare your theme for the new version of Obsidian:</p>\n<ol>\n<li>Create a copy of your <code>obsidian.css</code> file and rename it to <code>theme.css</code>. Keep the <code>obsidian.css</code> file in your repository so that older versions of Obsidian can continue to download your theme. If you have any preprocessing tools that output the <code>obsidian.css</code> file, make sure to update those as well.</li>\n<li>Test your theme on Obsidian 1.0 and apply any issues to <code>theme.css</code>.</li>\n<li>Create a <strong><code>manifest.json</code></strong> file in your repository. This file specifies the <code>minAppVersion</code> for your theme, meaning: versions of Obsidian that are older than the version you specify will not be able to install your theme.</li>\n</ol>\n<p><strong>Sample Manifest.json</strong></p>\n<pre><code class=\"language-json\">{  \n   &quot;name&quot;: &quot;Sample Theme&quot;,  \n   &quot;version&quot;: &quot;1.0.0&quot;,  \n   &quot;minAppVersion&quot;: &quot;1.0.0&quot;,  \n   &quot;author&quot;: &quot;Obsidian&quot;,  \n   &quot;authorUrl&quot;: &quot;https://obsidian.md&quot;  \n}\n</code></pre>\n<ol start=\"4\">\n<li><em>Optional:</em> Update your screenshot thumbnail. This should be 16:9 aspect ratio and the recommend size is 512 by 288px.</li>\n<li>Update your theme's README file. Clicking on the theme in the Theme Gallery will now the README file from Github. This means you have more space to promote your theme and can load additional screenshots to showcase different features.</li>\n<li>Create a Pull Request on the <code>obsidian-releases</code> repo and remove <code>&quot;legacy&quot;: true</code> from your  theme entry in <code>community-themes.json</code>.</li>\n</ol>\n<h2>How to design themes for v1.0+</h2>\n<p><strong>TLDR: Obsidian 1.0 introduces over 400 new CSS variables that help you style almost every aspect of the Obsidian UI. This enables themes to remove complex selectors and let variables do the heavy lifting.</strong></p>\n<p>With the release of Obsidian v1.0 we’ve made it much easier to create custom themes and snippets.</p>\n<p>Previously, many of Obsidian’s UI elements could only be targeted by writing complex CSS selectors with high specificity. Several selectors were typically required to target the same element across Reading mode and Live Preview.</p>\n<p>With v1.0 we have abstracted most UI elements into CSS variables applied to the <code>body</code> element. You can find an alphabetized list of all the CSS variables at the top of the <code>app.css</code> file. These variables are also designed to provide parity across Reading mode and Live Preview.</p>\n<p>Our goal was to make it possible to create highly expressive themes with less specificity in your CSS selectors. Most themes should be able to completely customize the interface by simply targeting <code>body</code> for interface styling, and <code>.theme-light</code>/<code>.theme-dark</code> for colors.</p>\n<p>We expect these changes to significantly reduce the number of lines of code in advanced themes. This should reduce maintainance work and make your code more future-proof.</p>\n<p>If you are working on a complex theme, consider simplifying your selectors and using the new CSS variables to do the heavy lifting. The new CSS variables should also make it easier to create styles that are responsive to conditional CSS classes.</p>\n<p><strong>Summary:</strong></p>\n<ul>\n<li>Explore the new variables in CSS by looking at <code>app.css</code> and using the Developer Tools</li>\n<li>Try to use the lowest specificity selectors you can. You may be able to only use <code>body</code>, <code>.theme-light</code> and <code>.theme-dark</code></li>\n</ul>\n<h2>New 1.0 features and modes to consider</h2>\n<p>Obsidian 1.0 contains new features and modes that you should consider in your theme.</p>\n<h4>Accent color</h4>\n<p>Users can now customize their accent color. Dynamic variables for accent HSL values <code>--accent-h</code>, <code>--accent-s</code>, <code>--accent-l</code> are provided which can be modified with the CSS <code>calc()</code> function.</p>\n<p>If you define these variables in your theme, the user will see your default accent color, and resetting to default will return the user to your specified default accent color.</p>\n<h4>Title bar style</h4>\n<p>In <code>Settings &gt; Appearance</code> users can now choose between three different title bar styles:</p>\n<ul>\n<li><strong>Hidden:</strong> no titlebar is displayed, only the the top row of tabs, default in 1.0+</li>\n<li><strong>Custom:</strong> displays a custom titlebar element that can be styled with CSS (previously the default in versions 0.15 and older)</li>\n<li><strong>Native:</strong> displays the native operating system titlebar</li>\n</ul>\n<h4>Top row of tabs and <code>.mod-top</code></h4>\n<p>The top area of the application which includes both the custom titlebar (if enabled) and the top row of tabs is considered a single UI area. The default theme uses a single background color for this top area.</p>\n<p>The <code>.mod-top</code> modifier class is added to the top row of tabs in sidebars and panes. Tab containers inside of <code>.mod-top</code> use the <code>--titlebar-background</code> variables rather than <code>--tab-container-background</code> variable.</p>\n<h4>Sidebars and sidebar buttons</h4>\n<p><strong>Note: the right ribbon has been removed</strong></p>\n<p>Sidebar toggle buttons have moved into the top row of tabs. Depending on the user’s operating system, the window buttons (minimize, maximize, close) may be on the left or right side of the application. When the user set title bar to Hidden, this means the position of the sidebar buttons needs to be accounted for.</p>\n<p>Consider the following scenarios, particularly when titlebar is hidden, on macOS vs. Windows:</p>\n<ul>\n<li>Left sidebar closed</li>\n<li>Right sidebar closed</li>\n<li>Popout widow does not have sidebars</li>\n<li>Fullscreen does not have window buttons</li>\n</ul>\n<h4>View header</h4>\n<p><strong>The view header is now disabled by default and the <code>view-header-icon</code> has been removed</strong></p>\n<p>Users can re-enable the view header in <code>Appearance</code> settings.</p>\n<h2>Design guidelines</h2>\n<p>Starting with 1.0, the default Obsidian experience is designed to be consistent with operating system design guidelines and best practices. Our intention is to make Obsidian feel familiar to new users, and create cohesiveness across the screens and modes of the application.</p>\n<p>We encourage plugin developers to follow these design guidelines so that users have a cohesive experience when using the default theme.</p>\n<h4>Padding, margins and spacing</h4>\n<p>Obsidian uses a 4 pixel grid. The 4 pixel grid is chosen because it enables the interface to scale up and down across high/low DPI screens, and also provides convenient ratios for layouts.</p>\n<p>UI elements use multiples of 4 for padding and spacing throughout the app. We recommend using the <code>--size</code> CSS variables to define all dimensions throughout your plugin.</p>\n<p>Each size variable contains two numbers which represent the base and the multiple, for example:</p>\n<ul>\n<li><code>--size-4-1</code> represents <code>4*1 = 4px</code></li>\n<li><code>--size-4-2</code> represents <code>4*2 = 8px</code></li>\n<li><code>--size-4-4</code> represents <code>4*4 = 16px</code></li>\n</ul>\n<p>A few <code>--size-2-x</code> variables are available for small spaces where fractions of 4 can be useful, e.g. <code>--size-2-1</code> represents <code>2*1 = 2px</code></p>\n<h4>Cursor</h4>\n<p>Obsidian follows operating system conventions for cursors. This means that the <code>pointer</code> cursor is only used when hovering over links. Avoid using the <code>pointer</code> cursor for buttons and interactive elements.</p>\n<ul>\n<li>Use <code>--cursor</code> variable to follow system conventions</li>\n<li>Use <code>--cursor-link</code> for links</li>\n</ul>\n<h4>Icons</h4>\n<p><strong>Important: In a future update to Obsidian, we will provide a new way for themes to replace icons. For now you should avoid replacing icons via CSS</strong></p>\n<p>Obsidian includes the <a href=\"https://lucide.dev/\">Lucide</a> icon library, which has over 800 icons that you can use for your plugin.</p>\n<p>If you are looking to use an icon that is not available in the Lucide library, you can create your own. For best compatibility and cohesiveness with Obsidian, your icons should <a href=\"https://github.com/lucide-icons/lucide/blob/main/docs/ICON_DESIGN_GUIDE.md\">follow Lucide’s guidelines</a></p>\n<ul>\n<li>Icons must be designed on a 24 by 24 pixels canvas</li>\n<li>Icons must have at least 1 pixel padding within the canvas</li>\n<li>Icons must have a stroke width of 2 pixels</li>\n<li>Icons must use round joins</li>\n<li>Icons must use round caps</li>\n<li>Icons must use centered strokes</li>\n<li>Shapes (such as rectangles) in icons must have border radius of 2 pixels</li>\n<li>Distinct elements must have 2 pixels of spacing between each other</li>\n</ul>\n<p>Lucide also <a href=\"https://github.com/lucide-icons/lucide/blob/main/CONTRIBUTING.md\">provides templates and guides</a> for vector editors such as Illustrator, Figma, and Inkscape.</p>\n",
			"date_published": "2022-08-29T00:00:00Z", 
			"author": {
				"name": "kepano"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/how-to-update-plugins-to-support-pop-out-windows/",
			"url": "https://obsidian.md/blog/how-to-update-plugins-to-support-pop-out-windows/",
			"title": "How to update your plugin to support pop-out windows",
			"content_html": "<p>With the desktop release of <a href=\"https://obsidian.md/changelog/2022-06-14-desktop-v0.15.0/\">Obsidian v0.15</a>, we're introducing a new way of putting panes into pop-out windows. For most plugins adding simple DOM based plugin views, this should work out-of-the-box.</p>\n<p>However, there are some things that work differently when your plugin renders things in pop-out windows.</p>\n<p>Pop-out windows come with a complete different set of globals. It has its own <code>Window</code> object, <code>Document</code> object, and fresh copies of all global constructors (like <code>HTMLElement</code> and <code>MouseEvent</code>).</p>\n<p>This means that some of the things you previously had assumed to be global and can have only one, will now only work in the main window. Here are some examples:</p>\n<pre><code class=\"language-javascript\">let myElement: HTMLElement = ...;\n\n// this will always append to the main window\ndocument.body.appendChild(myElement);\n\n// this will actually be false if element is in a pop-out window\nif (myElement instanceof HTMLElement) {\n\n}\n\nelement.on('click', '.my-css-class', (event) =&gt; {\n    // This will be false if the event is triggered in a pop-out window\n    if (event instanceof MouseEvent) {\n\n    }\n}\n</code></pre>\n<p>To facilitate plugins, <a href=\"https://github.com/obsidianmd/obsidian-api/blob/master/obsidian.d.ts\">we've updated the Obsidian API</a> to include various helper function and accessors.</p>\n<ul>\n<li>A global <a href=\"https://github.com/obsidianmd/obsidian-api/blob/b9bde9e32c007eb28c0fd632cf2c42b01dfd022a/obsidian.d.ts#L222\"><code>activeWindow</code></a> and <a href=\"https://github.com/obsidianmd/obsidian-api/blob/b9bde9e32c007eb28c0fd632cf2c42b01dfd022a/obsidian.d.ts#L227\"><code>activeDocument</code></a> variable, which always points to the current focused window and its document.</li>\n<li><a href=\"https://github.com/obsidianmd/obsidian-api/blob/b9bde9e32c007eb28c0fd632cf2c42b01dfd022a/obsidian.d.ts#L60\"><code>element.win</code></a> and <a href=\"https://github.com/obsidianmd/obsidian-api/blob/b9bde9e32c007eb28c0fd632cf2c42b01dfd022a/obsidian.d.ts#L56\"><code>element.doc</code></a>, which points to the Window and Document objects that the element belongs to.</li>\n<li>A function for performing cross-window compatible <code>instanceof</code> checks. Use <a href=\"https://github.com/obsidianmd/obsidian-api/blob/b9bde9e32c007eb28c0fd632cf2c42b01dfd022a/obsidian.d.ts#L50\"><code>element.instanceOf(HTMLElement)</code></a> and <a href=\"https://github.com/obsidianmd/obsidian-api/blob/b9bde9e32c007eb28c0fd632cf2c42b01dfd022a/obsidian.d.ts#L200\"><code>event.instanceOf(MouseEvent)</code></a></li>\n<li><a href=\"https://github.com/obsidianmd/obsidian-api/blob/b9bde9e32c007eb28c0fd632cf2c42b01dfd022a/obsidian.d.ts#L181\"><code>HTMLElement.onWindowMigrated(callback)</code></a> which hooks an event on the element for when it is inserted into a different window than it originally was in. This can be used for complex renderers like canvases to re-initialize the rendering context.</li>\n</ul>\n<p>Using the new APIs, the previous example would look like this:</p>\n<pre><code class=\"language-javascript\">let myElement: HTMLElement = ...;\n\n// this will append myElement to the same window as someElement\nsomeElement.doc.body.appendChild(myElement);\n\n// this will work correctly in pop-out windows\nif (myElement.instanceOf(HTMLElement)) {\n\n}\n\nelement.on('click', '.my-css-class', (event) =&gt; {\n    // this will work correctly in pop-out windows\n    if (event.instanceOf(MouseEvent)) {\n\n    }\n}\n</code></pre>\n",
			"date_published": "2022-07-12T00:00:00Z", 
			"author": {
				"name": "licat"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/codemirror-6-migration-guide/",
			"url": "https://obsidian.md/blog/codemirror-6-migration-guide/",
			"title": "Plugin developers: CodeMirror 6 migration guide for v6.0",
			"content_html": "<p>CodeMirror 6.0 is finally stable. That means Obsidian will be migrating from CM6 v0.19 to v6.0 soon.</p>\n<p>In this post I will attempt to summarize everything you need to know about this upcoming migration with breaking changes.</p>\n<p>When you upgrade your plugin to target CM6 v6.0, there is a possibility that it no longer works with older versions of Obsidian using CM6 v0.19. If this is the case, you should update your plugin's <code>manifest.json</code> to indicate that your <code>minAppVersion</code> is <code>0.15.0</code>, and also add the appropriate entries to <code>versions.json</code> to prevent users with older versions of Obsidian to upgrade your plugin.</p>\n<p>Major changes:</p>\n<ul>\n<li><code>Prec.fallback/override/extend</code> is now <code>Prec.highest/high/lowest</code>.</li>\n<li><code>blockAtHeight</code>, <code>visualLineAtHeight</code>, <code>viewportLines</code>, <code>visualLineAt</code> are now deprecated. The replacements work slightly differently but they should be <a href=\"https://codemirror.net/6/docs/ref/#view.EditorView.lineBlockAtHeight\"><code>lineBlockAtHeight</code></a>, <a href=\"https://codemirror.net/6/docs/ref/#view.EditorView.viewportLineBlocks\"><code>viewportLineBlocks</code></a> and <a href=\"https://codemirror.net/6/docs/ref/#view.EditorView.lineBlockAt\"><code>lineBlockAt</code></a>.</li>\n<li>Syntax trees <code>iterate</code> function has changed signature from 3 parameters <code>(node, from, to)</code> to a single object parameter <code>(obj: {node, type, from, to})</code> (<a href=\"https://lezer.codemirror.net/docs/ref/#common.SyntaxNodeRef\">details</a>)</li>\n<li><code>scrollPosIntoView</code>, <code>scrollTo</code>, and <code>centerOn</code> is now <a href=\"https://codemirror.net/6/docs/ref/#view.EditorView%5EscrollIntoView\"><code>scrollIntoView</code></a></li>\n<li>Plugin fields no longer exist, and providing decorations from a view plugin now happens by providing a function to the <a href=\"https://codemirror.net/6/docs/ref/#view.EditorView%5Edecorations\"><code>EditorView.decorations</code></a> facet. Same for atomic ranges and scroll margins — you must use a facet for them now.</li>\n<li>Many packages has been merged into other packages:\n<ul>\n<li><code>text</code> and <code>rangeset</code> are merged into <code>state</code>.</li>\n<li><code>tooltip</code>, <code>gutter</code>, <code>panel</code>, and <code>rectangular-selection</code> are merged into <code>view</code>.</li>\n<li><code>matchbrackets</code>, <code>stream-parser</code>, <code>fold</code> are merged into <code>language</code>. The custom exports from <code>stream-parser</code> are now available at <a href=\"https://github.com/lishid/cm-language\"><code>lishid/cm-language</code></a>.</li>\n<li><code>comment</code> and <code>history</code> are merged into <code>commands</code>.</li>\n<li><code>closebrackets</code> is merged into <code>autocomplete</code>.</li>\n<li><code>highlight</code> is split into <code>language</code> and <code>@lezer/highlight</code>.</li>\n</ul>\n</li>\n</ul>\n<p>For more minor changes, check out <a href=\"https://discuss.codemirror.net/t/release-0-20-0/4302\">the full breaking release notes</a>.</p>\n",
			"date_published": "2022-06-14T00:00:00Z", 
			"author": {
				"name": "licat"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/2021-goty-winners/",
			"url": "https://obsidian.md/blog/2021-goty-winners/",
			"title": "2021 Gems of the year winners",
			"content_html": "<p>The results of Gems of the Year 2021 are out!</p>\n<p><a href=\"https://obsidian.md/goty2021\" title=\"https://obsidian.md/goty2021\">See the results</a></p>\n",
			"date_published": "2022-01-25T00:00:00Z", 
			"author": {
				"name": "silver"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/live-preview-update/",
			"url": "https://obsidian.md/blog/live-preview-update/",
			"title": "Live Preview update",
			"content_html": "<p>Obsidian 0.13 introduces a brand new editor engine that comes with several enhancements to your editing experience. In this post, we'll take a closer look at one of the biggest improvements in the latest release: <em>Live Preview</em>.</p>\n<p>Live Preview is a new editor mode that lets you preview your notes in the same view that you're writing them in. Live Preview delivers a cleaner writing experience by only displaying Markdown syntax around the cursor. Let's see an example!</p>\n<p>This is what your editing experience used to look like:</p>\n<p><img src=\"https://publish-01.obsidian.md/access/f786db9fac45774fa4f0d8112e232d67/Attachments/Source%20view.png\" alt=\"Source view\" /></p>\n<p>And here's the same note using Live Preview:</p>\n<p><img src=\"https://publish-01.obsidian.md/access/f786db9fac45774fa4f0d8112e232d67/Attachments/Live%20preview.gif\" alt=\"Livew Preview\" /></p>\n<p>Live Preview gives you an improved editing experience that lets you see how your Markdown note will look like, without having to switch between Edit and Preview.</p>\n<p>To enable Live Preview for an existing vault:</p>\n<ol>\n<li>Open <strong>Settings</strong>.</li>\n<li>In the sidebar, click <strong>Editor</strong>.</li>\n<li>Under <strong>General</strong>, disable <strong>Legacy Editor</strong>.</li>\n<li>Click on the <strong>Relaunch</strong> button for the change to take effect.</li>\n<li>After Obsidian restarts, open <strong>Settings</strong>.</li>\n<li>In the sidebar, click <strong>Editor</strong>.</li>\n<li>Under <strong>General</strong>, set <strong>Default editing mode</strong> to <strong>Live Preview</strong>.</li>\n</ol>\n<p>When you open a new pane, it'll use Live Preview by default. If you already have some panes open, they'll be in <em>Source mode</em>.</p>\n<h2>Edit notes using Live Preview or Source mode</h2>\n<p>We think you're going to love Live Preview. But if you want to keep your current editing experience, we've got you covered. You can keep editing your notes the same way as before by switching to the new Source mode.</p>\n<p>To toggle between Live Preview and Source mode:</p>\n<ol>\n<li>In the upper right corner of the pane, click <strong>More options</strong> (the three dots).</li>\n<li>Select <strong>Toggle source/live preview mode</strong>.</li>\n</ol>\n<p>You can also toggle the editing view by opening the Command palette and searching for the <strong>Toggle source/live preview mode command</strong>, or change it permanently by setting <strong>Default editing mode</strong> to Source mode.</p>\n<p>Live Preview and Source mode are two ways to edit your Markdown notes in Obsidian. Try them out to see which one you prefer!</p>\n<p>If you want to know how the terminology changes with the new features, here's a handy chart by Argentum:</p>\n<p><img src=\"https://publish-01.obsidian.md/access/f786db9fac45774fa4f0d8112e232d67/Attachments/Editor%20update%20chart.png\" alt=\"Editor update chart\" /></p>\n<h2>Wait, I'm not ready to switch!</h2>\n<p>Some plugins and themes may not be fully compatible with the new editor. If your favorite plugin doesn't yet support the new editor, you can switch back to the old one by enabling the Legacy editor.</p>\n<ol>\n<li>Open <strong>Settings</strong>.</li>\n<li>In the sidebar, click <strong>Editor</strong>.</li>\n<li>Under <strong>General</strong>, enable <strong>Legacy Editor</strong>.</li>\n<li>Click on the <strong>Relaunch</strong> button for the change to take effect.</li>\n</ol>\n<p>Use the legacy editor if you're not ready to upgrade to the new editor. You'll miss out some sweet features, but know that you can switch to the new editor at any time.</p>\n",
			"date_published": "2021-12-15T00:00:00Z", 
			"author": {
				"name": "silver"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/2021-goty-nominations/",
			"url": "https://obsidian.md/blog/2021-goty-nominations/",
			"title": "2021 Gems of the year nominations",
			"content_html": "<p>Hey, it's that time of the year again! 🎉</p>\n<p>This year, we're calling our end-of-year award &quot;Gems of the Year&quot;. (Yes, it's coincidentally also abbreviated &quot;GotY&quot; for you gamers out there 😆 )</p>\n<p>This year, we're looking for great plugins, themes, content creators, workflows, and achievements! If you found anything useful from any of the categories above, come and nominate your favorites!</p>\n<p>Timeline:</p>\n<ul>\n<li>Nomination: now ~ Dec 15</li>\n<li>Voting: Dec 16 ~ Jan 5</li>\n</ul>\n<p><a href=\"https://publish.obsidian.md/hub/01+-+Community/Events/Gems+of+the+Year+2021\">Find event details on the Obsidian Hub</a></p>\n<p>To nominate:</p>\n<ul>\n<li><a href=\"https://forum.obsidian.md/t/obsidian-gems-of-the-year-2021-nomination-plugins/28224\">Nominate plugins</a></li>\n<li><a href=\"https://forum.obsidian.md/t/obsidian-gems-of-the-year-2021-nomination-themes/28225\">Nominate themes</a></li>\n<li><a href=\"https://forum.obsidian.md/t/obsidian-gems-of-the-year-2021-nomination-content-creators/28226\">Nominate content creators</a></li>\n<li><a href=\"https://forum.obsidian.md/t/obsidian-gems-of-the-year-2021-nomination-workflows/28227\">Nominate workflows</a></li>\n<li><a href=\"https://forum.obsidian.md/t/obsidian-gems-of-the-year-2021-nomination-achievements/28228\">Nominate achievements</a></li>\n</ul>\n",
			"date_published": "2021-12-08T00:00:00Z", 
			"author": {
				"name": "silver"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/2021-obsidian-october-winners/",
			"url": "https://obsidian.md/blog/2021-obsidian-october-winners/",
			"title": "Obsidian October 2021 winners",
			"content_html": "<p>If you’re following Obsidian October 2021, the results are in and the prizes are on their way!</p>\n<p><a href=\"https://obsidian.md/october2021\">See the results</a></p>\n<p>Congrats to Primary, Sanctum, Prism, Bubble Space (themes), and CodeMirror Options, Fantasy Calendar, Graph Analysis, Vale (plugins)!</p>\n<p>See you next year!</p>\n",
			"date_published": "2021-12-01T00:00:00Z", 
			"author": {
				"name": "silver"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/2021-obsidian-october-announcement/",
			"url": "https://obsidian.md/blog/2021-obsidian-october-announcement/",
			"title": "Obsidian October 2021: make plugins and themes together and win awards!",
			"content_html": "<p>Been thinking about making a plugin or theme but never had the opportunity to do it? October is the time!</p>\n<p>Obsidian October is an official event to help you get started with making your very own plugins and themes, starting now and ending on Oct 31, 2021.</p>\n<p>Make a plugin or theme (or both!) to win some awesome awards! Winners will get hundreds of dollars in credit to spend on Obsidian services; the top winner will even get a custom trophy from us! Submissions will be judged by our awesome judge panel: <a href=\"https://forum.obsidian.md/u/liam\">@liam</a> , <a href=\"https://forum.obsidian.md/u/mgmeyers\">@mgmeyers</a> and <a href=\"https://forum.obsidian.md/u/argentum\">@argentum</a> for plugins and <a href=\"https://forum.obsidian.md/u/kepano\">@kepano</a>, <a href=\"https://forum.obsidian.md/u/chetachi\">@Chetachi</a> and <a href=\"https://forum.obsidian.md/u/slrvb\">@SlRvb</a> for themes.</p>\n<p>Even if you don’t win, you’ll get to make your first plugin or theme and have a chance to be one of 3 randomly chosen lucky winners for each category!</p>\n<p>Read more event details here: <a href=\"https://publish.obsidian.md/hub/Events/Obsidian+October+2021\">Obsidian October 2021</a></p>\n<p>Get the Discord role by reacting to <a href=\"https://discord.com/channels/686053708261228577/702717892533157999/889615286095986688\">this message</a> if you’re on our Discord.</p>\n",
			"date_published": "2021-09-21T00:00:00Z", 
			"author": {
				"name": "silver"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/last-chance-to-get-early-bird/",
			"url": "https://obsidian.md/blog/last-chance-to-get-early-bird/",
			"title": "Last chance to get early bird discount for Sync and Publish",
			"content_html": "<p>This is a heads-up that early bird discount for both Obsidian Sync and Obsidian Publish will end on September 30, 2021.</p>\n<p>We waited a bit to end the early bird discount in order to accommodate back-to-school season, so if Obsidian helps with your studies, right now would be a good time to grab either services. We’re a small team who depends on people like you to spread the word to grow, so please please recommend Obsidian to your classmates and peers if you find helpful, thank you so much!</p>\n<h2>FAQ</h2>\n<p><strong>Q: I live in another time zone. Which time zone is the deadline in?</strong></p>\n<p>A: We understand the end of September 30 is not the same time everywhere in the world. As long as you pay before the end of that day in your local time zone, you will be fine.</p>\n<p><strong>Q: I’m paying via PayPal and haven’t received my instructions, will I miss the early bird discount?</strong></p>\n<p>A: As long as you send an email to us before September 30 in your local time, you can get it! It might take some time to process all the requests but you will still qualify.</p>\n<p><strong>Q: I’m paying via Wechat and have not received my service before September, will I miss the early bird discount?</strong></p>\n<p>A: As long as you send the payment and email us before September 30 in your local time, you will get early bird discount for life.</p>\n<p><strong>Q : Can I switch from monthly to yearly or yearly to monthly after the discount ends?</strong></p>\n<p>A: Yes, you can switch without losing the discount.</p>\n<p><strong>Q: If I buy Sync now, will I have discount for Publish?</strong></p>\n<p>A: No, the discounts work separately. The Publish discount doesn’t work for Sync either.</p>\n<p><strong>Q: If I stop renewing my subscription after getting the early bird discount, will I still have it?</strong></p>\n<p>A: Yes, your account will always have the discount even after you stop renewing. But you need to pay at least once; if you refund all the payments, you will lose the early bird discount.</p>\n<p><strong>Q: Do I have to buy Sync and Publish? Are there free alternatives?</strong></p>\n<p>A: No, you don’t have to buy them to sync or publish your vault. Their selling points are convenience and easy setup.</p>\n<p>To synchronize your vault between devices, you can use any sync solution that works on local folders, such as Dropbox, iCloud, and Google Drive. For mobile, you may need apps like DropSync to help with syncing, although iCloud can work for iOS.</p>\n<p>To publish your vault is a more technical task. Fortunately Markdown is a developer favorite, and there are lots of popular tools to convert Markdown into static, ready-to-publish sites like Hugo, Jekyll, and Quartz.</p>\n<p><strong>Q: If i purchased an Obsdian publish for one site, will be the early bird price apply for additional sites after September 30th?</strong></p>\n<p>A: Yes, as long as you’ve purchased Publish by the end of September, your account will be grandfathered for early bird rates and the discount will apply for any additional sites you purchase under the same account.</p>\n",
			"date_published": "2021-07-01T00:00:00Z", 
			"author": {
				"name": "silver"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/2020-goty-winners/",
			"url": "https://obsidian.md/blog/2020-goty-winners/",
			"title": "2020 Gems of the year winners",
			"content_html": "<p>Best of 2020 Award results are out! Congrats everyone! 🎉 (<a href=\"https://forum.obsidian.md/t/best-of-2020-voting-thread-theme-plugin-graph-story/10105\">Link to vote count results</a>)</p>\n<p>We’ll be contacting everyone shortly to send our little prizes out. See you at the Best of 2021 Award!</p>\n<h2>Themes</h2>\n<ul>\n<li>Best theme: <a href=\"https://forum.obsidian.md/t/minimal-theme/3659\">Minimal</a> by @kepano</li>\n<li>Runner-up: <a href=\"https://forum.obsidian.md/t/theme-blue-topaz-v1-7-updated-20201209-for-v0-9-22/6425\">Blue Topaz</a> by @WhyI</li>\n<li>Lucky winner*: <a href=\"https://forum.obsidian.md/t/obsidianite-theme-version-1-1-1-nov-17-2020/7876\">Obsidianite</a> by @TriDiamond</li>\n</ul>\n<h2>Plugins</h2>\n<ul>\n<li>Best plugin: <a href=\"https://forum.obsidian.md/t/sliding-panes-andy-matushcak-mode-plugin/7652\">Sliding Panes</a> by @death.au</li>\n<li>Runner-up: <a href=\"https://github.com/liamcain/obsidian-calendar-plugin\">Calendar</a> by @liam</li>\n<li>Lucky winner*: <a href=\"https://forum.obsidian.md/t/obsidian-git-plugin-for-automatic-vault-backup-with-git/7790\">Obsidian Git</a> by @evrwhr</li>\n</ul>\n<h2>Graph</h2>\n<ul>\n<li>Best graph: <a href=\"https://forum.obsidian.md/t/obsidian-graph-of-the-year-2020-nomination-thread/9365/13\">KGB_Vault</a> by @websinthe</li>\n<li>Runner-up: <a href=\"https://forum.obsidian.md/t/obsidian-graph-of-the-year-2020-nomination-thread/9365/17\">Santi’s vault</a> by @Santi</li>\n<li>Lucky winner*: <a href=\"https://forum.obsidian.md/t/obsidian-graph-of-the-year-2020-nomination-thread/9365/9\">Connectome</a> by @QuantumNeurotechno</li>\n</ul>\n<h2>Stories</h2>\n<ul>\n<li>Best story: <a href=\"https://forum.obsidian.md/t/obsidian-story-of-the-year-2020-nomination-thread/9366/5\">“I never chose to write, Obsidian made me write”</a> by @base</li>\n<li>Runner-up: <a href=\"https://forum.obsidian.md/t/obsidian-story-of-the-year-2020-nomination-thread/9366/7\">“From Paper Zettelkasten To Obsidian”</a> by @Santi</li>\n<li>Lucky winner*: <a href=\"https://forum.obsidian.md/t/obsidian-story-of-the-year-2020-nomination-thread/9366/2\">“Obsidian-made publication at the top journal of my field”</a> by thanks4player</li>\n</ul>\n<hr />\n<ul>\n<li>To ensure fairness, lucky winners are selected by first shuffling the entries and then letting a moderator picking a random number without looking at the entries.</li>\n</ul>\n",
			"date_published": "2021-01-09T00:00:00Z", 
			"author": {
				"name": "silver"
			}
		}
		,
		{
			"id": "https://obsidian.md/blog/2020-goty-nominations/",
			"url": "https://obsidian.md/blog/2020-goty-nominations/",
			"title": "2020 Gems of the year nominations",
			"content_html": "<p>Hi everyone!</p>\n<p>We’ve had a complicated relationship with 2020, and now it’s almost time to say goodbye. Reflecting on the year, many awesome themes and plugins were developed, and memorable stories and stunning graphs were shared.</p>\n<p>To celebrate all these wonderful contributions, we have set up an award for the best themes, plugins, graphs, and stories of the year.</p>\n<p>It works like this: people can either nominate their own creations, graphs, or stories (encouraged), or you can nominate someone else. The nomination phase starts now and ends on December 15.</p>\n<p>Here are the nomination threads:</p>\n<ul>\n<li>Theme of the Year: <a href=\"https://forum.obsidian.md/t/obsidian-theme-of-the-year-2020-nomination-thread/9362\">Obsidian Theme of the Year 2020 nomination thread</a></li>\n<li>Plugin of the Year: <a href=\"https://forum.obsidian.md/t/obsidian-plugin-of-the-year-2020-nomination-thread/9364\">Obsidian Plugin of the Year 2020 nomination thread</a></li>\n<li>Graph of the Year: <a href=\"https://forum.obsidian.md/t/obsidian-graph-of-the-year-2020-nomination-thread/9365\">Obsidian Graph of the Year 2020 nomination thread</a></li>\n<li>Story of the Year: <a href=\"https://forum.obsidian.md/t/obsidian-story-of-the-year-2020-nomination-thread/9366\">Obsidian Story of the Year 2020 nomination thread</a></li>\n</ul>\n<p>After that, we compile the results and let the entire community vote. Each category will have a top prize, a runner-up, and a random lucky winner. The winners will be officially acknowledged, as well as getting both digital and physical goodies from the developer team (we’ll need your mailing address!).</p>\n",
			"date_published": "2020-12-01T00:00:00Z", 
			"author": {
				"name": "silver"
			}
		}
		
	]
}
